[
    {
        "name": "Apple",
        "address": "Apple Park, 1 Apple Park Way, Cupertino, CA 95014",
        "id": "d2767b84-b725-4cd1-b07e-ea6c65bcc4a1",
        "lat": 37.3287379,
        "lng": -122.0078912,
        "imageName": "apple.com.jpg",
        "description": "Apple Inc. designs and sells iPhones, Macs, iPads, Apple Watch, and other premium consumer electronics. It pairs this hardware with proprietary software like iOS and macOS and services such as iCloud, Apple Music, and Apple TV+. Founded in 1976 by Steve Jobs, Steve Wozniak, and Ronald Wayne, the company pioneered the graphical-user-interface personal computer. Apple is publicly traded (AAPL) and is regularly ranked among the world’s most valuable companies. Its headquarters, Apple Park, is a circular, solar-powered campus often called “the spaceship.”",
        "wikipediaSlug": "Apple_Inc.",
        "isHeadquarters": true
    },
    {
        "name": "Google (Alphabet)",
        "address": "1600 Amphitheatre Parkway, Mountain View, CA 94043",
        "id": "20598f52-d573-4c6c-9dc9-3102ac2bf5f4",
        "lat": 37.4220101,
        "lng": -122.0847516,
        "imageName": "google.com.jpg",
        "description": "Alphabet is the parent company of Google and numerous other businesses ranging from self-driving cars (Waymo) to health tech (Verily). Google dominates global web search and digital advertising while also operating Android, YouTube, Google Cloud, and Google Maps. Founded in 1998 by Larry Page and Sergey Brin, the firm restructured as Alphabet in 2015 to separate its core internet services from longer-term “moonshots.” Advertising still provides the lion’s share of revenue, but cloud services and AI tools are the fastest-growing segments. Alphabet is one of the “Big Five” U.S. tech giants and trades under the tickers GOOGL and GOOG.",
        "wikipediaSlug": "Google",
        "isHeadquarters": true
    },
    {
        "name": "Meta (Facebook)",
        "address": "1601 Willow Road Menlo Park, CA 94025",
        "id": "7e777c6a-eec2-42e7-a974-9df48cb42540",
        "lat": 37.482503,
        "lng": -122.1479457,
        "imageName": "meta.com.jpg",
        "description": "Meta Platforms owns Facebook, Instagram, WhatsApp, Messenger, and Threads, serving billions of monthly users worldwide. Advertising on these social apps generates nearly all of the company’s revenue, making Meta one of the largest digital ad sellers. Rebranded from Facebook to Meta in 2021, the company invests heavily in virtual- and augmented-reality hardware through its Reality Labs division. Founder and CEO Mark Zuckerberg has positioned Meta to build the “metaverse,” an immersive, interconnected digital world. Despite rapid growth, the firm faces ongoing scrutiny over privacy, content moderation, and competition.",
        "wikipediaSlug": "Facebook",
        "isHeadquarters": true
    },
    {
        "name": "Netflix",
        "address": "121 Albright Way, Los Gatos, CA 95032",
        "id": "cf4ce934-cea0-422e-8f2d-2482c602216a",
        "lat": 37.2570306,
        "lng": -121.9639833,
        "imageName": "netflix.com.jpg",
        "description": "Netflix is the world’s leading subscription streaming service, offering films, TV series, and mobile games in more than 190 countries. Originally a DVD-by-mail company founded in 1997, it pivoted to streaming in 2007 and began producing original content like “House of Cards” in 2013. Today its library features hundreds of Netflix Originals that often dominate award shows and global pop-culture conversation. The platform operates on tiered, monthly plans and introduced an ad-supported option in 2023. With tens of millions of subscribers, Netflix competes with Disney+, Prime Video, and other big streamers for viewer attention.",
        "wikipediaSlug": "Netflix",
        "isHeadquarters": true
    },
    {
        "name": "Intel",
        "address": "2200 Mission College Blvd, Santa Clara, CA 95054",
        "id": "091d9ebc-f457-43b4-b5ae-7f0fef6008a4",
        "lat": 37.3880625,
        "lng": -121.9655205,
        "imageName": "intel.com.jpg",
        "description": "Intel Corporation is a pioneer of the microprocessor, powering most personal computers for decades with its x86 CPU architecture. Founded in 1968, the company now produces processors, graphics chips, networking gear, memory, and advanced packaging technologies. Intel is investing billions in U.S. and European fabs to regain manufacturing leadership and meet growing AI and data-center demand. Its products serve PCs, servers, edge-computing devices, and automotive applications. The iconic “Intel Inside” marketing campaign made the brand a household name.",
        "wikipediaSlug": "Intel",
        "isHeadquarters": true
    },
    {
        "name": "Nvidia",
        "address": "2788 San Tomas Expressway, Santa Clara, CA 95051",
        "id": "95b2cb57-dc34-45ff-bd4a-221014be2498",
        "lat": 37.37187,
        "lng": -121.9659302,
        "imageName": "nvidia.com.jpg",
        "description": "Nvidia pioneered the graphics processing unit (GPU) in 1999, sparking the modern PC-gaming boom. Its parallel-processing chips now power cutting-edge AI, data-center acceleration, autonomous vehicles, and digital-twin simulations. Led by co-founder Jensen Huang, Nvidia has transformed into a full-stack computing company providing hardware, software, and cloud services such as DGX systems and the Omniverse platform. GeForce GPUs remain popular with gamers and creators, while the company’s data-center revenue has surged amid generative-AI demand. Nvidia briefly surpassed US $3 trillion in market capitalization in 2025, reflecting its central role in the AI economy.",
        "wikipediaSlug": "Nvidia",
        "isHeadquarters": true
    },
    {
        "name": "HP (Hewlett-Packard)",
        "address": "1501 Page Mill Road, Palo Alto, CA 94304",
        "id": "dbaa9191-30b8-45b7-b1f5-49490178bb09",
        "lat": 37.4118997,
        "lng": -122.1497962,
        "imageName": "hp.com.jpg",
        "description": "HP Inc. traces its roots to a 1939 Palo Alto garage often cited as the birthplace of Silicon Valley. The company focuses today on PCs, printers, and related services after splitting from Hewlett Packard Enterprise in 2015. HP is a global PC-shipment leader, known for its Spectre laptops, OMEN gaming rigs, and enterprise LaserJet printers. It is committed to sustainability, using recycled plastics and closing the loop on printer supplies. HP operates in nearly every country, serving consumers, businesses, and schools with hardware, managed print, and device-as-a-service offerings.",
        "wikipediaSlug": "Hewlett-Packard",
        "isHeadquarters": true
    },
    {
        "name": "Cisco Systems",
        "address": "170 West Tasman Drive, San Jose, CA 95134",
        "id": "7c05700d-1ca6-4067-91f4-22ea403ab688",
        "lat": 37.4083615,
        "lng": -121.9541545,
        "imageName": "cisco.com.jpg",
        "description": "Cisco Systems is the world’s leading supplier of networking equipment and enterprise cybersecurity solutions. Its routers, switches, wireless gear, and Webex collaboration suite underpin much of the internet’s backbone and corporate IT infrastructure. Founded in 1984 by Stanford computer scientists, Cisco grew rapidly during the dot-com boom by acquiring dozens of startups. The company now derives a growing share of revenue from subscription software, security, and observability products. Cisco’s certification programs (CCNA, CCIE) are industry standards for network professionals.",
        "wikipediaSlug": "Cisco",
        "isHeadquarters": true
    },
    {
        "name": "Adobe",
        "address": "345 Park Avenue, San Jose, CA 95110",
        "id": "e42811ba-4600-4b03-8f3b-fa5e2f2b71ad",
        "lat": 37.3308453,
        "lng": -121.8942626,
        "imageName": "adobe.com.jpg",
        "description": "Adobe Inc. empowers creatives and marketers with flagship software such as Photoshop, Illustrator, Premiere Pro, and Acrobat PDF. Since 2013 the company has shifted to a cloud-subscription model under Creative Cloud, Document Cloud, and Experience Cloud brands. Adobe Sensei, its AI engine, fuels generative-AI features like Firefly for image synthesis and automated video edits. Founded in 1982, Adobe helped establish the desktop-publishing revolution with PostScript and later the ubiquitous PDF standard. Its tools are considered industry benchmarks for digital imaging, design, and marketing analytics.",
        "wikipediaSlug": "Adobe_Inc.",
        "isHeadquarters": true
    },
    {
        "name": "eBay",
        "address": "2025 Hamilton Avenue, San Jose, CA 95125",
        "id": "f20eb476-2e82-4b03-a523-96d56ca6bc13",
        "lat": 37.2952019,
        "lng": -121.9267507,
        "imageName": "ebay.com.jpg",
        "description": "eBay Inc. is a global e-commerce marketplace that enables consumer-to-consumer and business-to-consumer sales of new and used goods. Founded in 1995 as AuctionWeb by Pierre Omidyar, it popularized online auctions before shifting toward fixed-price “Buy It Now” listings. The platform hosts 130 million active buyers and handled about US $73 billion in gross merchandise volume in 2024. eBay generates revenue through seller fees, advertising, and payment services after spinning off PayPal in 2015. Its feedback rating system established early trust and remains a hallmark of online marketplaces.",
        "wikipediaSlug": "EBay",
        "isHeadquarters": true
    },
    {
        "name": "PayPal",
        "address": "2211 N 1st St, San Jose, CA 95131-2021",
        "id": "b6aec80d-d266-407f-b99a-85e8fa85e496",
        "lat": 37.3768642,
        "lng": -121.9229464,
        "imageName": "paypal.com.jpg",
        "description": "PayPal Holdings operates one of the world’s largest digital-payments platforms, connecting more than 400 million consumers and merchants across nearly 200 markets. Its services enable online checkout, peer-to-peer transfers via PayPal and Venmo, and in-store QR payments. Founded in 1998 and famously tied to the “PayPal Mafia” of Silicon Valley entrepreneurs, it was acquired by eBay in 2002 and spun out as an independent public company in 2015. PayPal earns fees on each transaction and offers merchant services like fraud protection and working-capital loans. The firm is expanding into crypto trading and “buy now, pay later” installments.",
        "wikipediaSlug": "PayPal",
        "isHeadquarters": true
    },
    {
        "name": "Tesla Engineering HQ",
        "address": "1501 Page Mill Road Palo Alto, CA 94304",
        "id": "2c10dcde-ba7c-458c-9658-5e6078cc0576",
        "lat": 37.4118261,
        "lng": -122.1481305,
        "imageName": "tesla.com.jpg",
        "description": "Tesla, Inc. designs and manufactures electric vehicles, battery-storage systems, and solar-energy products with a mission to accelerate the world’s transition to sustainable energy. The Palo Alto Engineering HQ focuses on vehicle design, powertrain innovation, and Autopilot software. Since the 2012 Model S, Tesla has scaled production to deliver mass-market EVs like the Model 3 and Model Y and premium products such as Cybertruck and Semi. Tesla operates a global Supercharger network to alleviate range anxiety and sells energy products including Powerwall and Megapack batteries. CEO Elon Musk’s bold timelines and innovations keep Tesla in the media spotlight and stock-market limelight.",
        "wikipediaSlug": "Tesla,_Inc.",
        "isHeadquarters": true
    },
    {
        "name": "LinkedIn HQ",
        "address": "1000 W Maude Ave, Sunnyvale, CA 94085",
        "id": "f9486faa-0410-4ae8-bc4a-0ebc5de98a51",
        "lat": 37.3923878,
        "lng": -122.0421758,
        "imageName": "linkedin.com.jpg",
        "description": "LinkedIn is the world’s largest professional networking platform, boasting over one billion members across 200+ countries. Users maintain digital résumés, connect with colleagues, search jobs, and publish industry content, while recruiters and sales teams leverage premium data tools. Founded in 2003 and acquired by Microsoft for US $26 billion in 2016, LinkedIn generates revenue from advertising, subscriptions like LinkedIn Premium and Sales Navigator, and talent solutions. Its Sunnyvale campus houses product, engineering, and sales teams that support the ever-growing network. The platform’s “Open to Work” and skill-endorsement features have reshaped modern hiring.",
        "wikipediaSlug": "LinkedIn",
        "isHeadquarters": true
    },
    {
        "name": "LinkedIn Office",
        "address": "222 Second Street, San Francisco, CA 94105",
        "id": "4d2d4ff0-fbf0-4a50-a7d2-71984b856e2a",
        "lat": 37.7864752,
        "lng": -122.3981167,
        "imageName": "linkedin.com.jpg",
        "description": "LinkedIn’s San Francisco office anchors its presence in the heart of the Bay Area tech scene. Teams here focus on product design, engineering initiatives, and partnerships with enterprise customers. The downtown location enables collaboration with startups and Fortune 500 clients seeking talent solutions. Like all LinkedIn sites, it emphasizes a culture of transformation, integrity, and results. The office also hosts community events on career development and diversity in tech.",
        "wikipediaSlug": "LinkedIn",
        "isHeadquarters": false
    },
    {
        "name": "Yahoo",
        "address": "701 1st Ave, Sunnyvale, CA 94089",
        "id": "c0161a80-3e3a-4df4-8ec5-fa5028a8bffa",
        "lat": 37.4187924,
        "lng": -122.0257514,
        "imageName": "yahoo.com.jpg",
        "description": "Yahoo is an internet pioneer offering email, news, sports, finance, and advertising services to a global audience. Founded in 1994, the company once dominated web search and media before selling its core business to Verizon in 2017; it is now privately held as part of Apollo Global Management. Yahoo’s homepage, fantasy-sports leagues, and Yahoo Finance remain heavily trafficked destinations. Most revenue comes from digital display and search advertising sold across its content network. The iconic exclamation-point logo and purple color scheme still resonate with longtime users.",
        "wikipediaSlug": "Yahoo",
        "isHeadquarters": true
    },
    {
        "name": "Oracle",
        "address": "Oracle Building 300, 300 Oracle Pkwy, Redwood City, CA 94065",
        "id": "3c57de9a-f563-4ce7-a227-9d5972128c16",
        "lat": 37.53059750000001,
        "lng": -122.264388,
        "imageName": "oracle.com.jpg",
        "description": "Oracle Corporation is a multinational provider of database software, cloud infrastructure, and enterprise applications such as ERP, HCM, and CRM. Founded in 1977 by Larry Ellison, the company commercialized the first SQL relational database and remains a market leader with Oracle Database and Exadata systems. It offers Oracle Cloud Infrastructure (OCI) to compete with AWS, Azure, and Google Cloud, emphasizing high-performance and security for enterprise workloads. Oracle has acquired over 140 companies, including Sun Microsystems, PeopleSoft, and Cerner, to broaden its portfolio. Headquarters at Redwood Shores feature the distinctive blue glass “sailboat” towers overlooking a man-made lagoon.",
        "wikipediaSlug": "Oracle_Corporation",
        "isHeadquarters": true
    },
    {
        "name": "Sun Microsystems (now Oracle)",
        "address": "4150 Network Circle Santa Clara, CA 95054",
        "lat": 37.393412056086994,
        "lng": -121.95399945617885,
        "imageName": "sunmicrosystems.jpg",
        "id": "f51e345f-7c4d-4aa3-98ea-b4cdfb90c953",
        "isHeadquarters": false,
        "description": "This place was the former headquarters of Sun microsystems. Now it is the place of some Oracle offices",
        "wikipediaSlug": "Sun_Microsystems"
    },
    {
        "name": "Western Digital",
        "address": "5601 Great Oaks Parkway, San Jose, CA 95119",
        "id": "8a4ed159-150b-433a-ad82-f391e1003568",
        "lat": 37.2456193,
        "lng": -121.7937037,
        "imageName": "westerndigital.com.jpg",
        "description": "Western Digital designs and manufactures data-storage devices and solutions under the Western Digital, WD, and SanDisk brands. Its product lineup spans hard-disk drives, solid-state drives, and flash memory used in PCs, smartphones, data centers, and connected cars. Founded in 1970 as General Digital, the company pivoted from semiconductors to storage and now operates large fabrication facilities in the U.S. and Asia. Western Digital partners with Kioxia in Japan to produce advanced flash memory. As global data generation skyrockets, the firm focuses on capacity leadership and energy-efficient drives.",
        "wikipediaSlug": "Western_Digital",
        "isHeadquarters": true
    },
    {
        "name": "AMD (Advanced Micro Devices)",
        "address": "2485 Augustine Drive, Santa Clara, CA 95054",
        "id": "388e6cd0-2a67-431d-a5cd-26e294df4d74",
        "lat": 37.3829254,
        "lng": -121.9703842,
        "imageName": "amd.com.jpg",
        "description": "Advanced Micro Devices designs high-performance CPUs, GPUs, and adaptive SoCs for PCs, gaming consoles, data centers, and automotive systems. Its Ryzen processors and Radeon graphics compete head-to-head with Intel and Nvidia, while EPYC server chips power hyperscale clouds. AMD became a fabless company after spinning off GlobalFoundries in 2009 and acquired FPGA leader Xilinx in 2022 to expand into adaptive computing. CEO Lisa Su is credited with reviving AMD’s fortunes through innovative Zen architectures. The company’s chips appear in both Microsoft Xbox and Sony PlayStation consoles.",
        "wikipediaSlug": "AMD",
        "isHeadquarters": true
    },
    {
        "name": "Salesforce",
        "address": "Salesforce Tower, 415 Mission Street, 3rd Floor, San Francisco, CA 94105",
        "id": "6f6a42af-3651-48a0-815d-95bdc54b9fac",
        "lat": 37.7897969,
        "lng": -122.3972342,
        "imageName": "salesforce.com.jpg",
        "description": "Salesforce pioneered cloud-based customer-relationship-management (CRM) software with its 1999 “No Software” model. Its Customer 360 platform now includes sales, service, marketing, analytics, and Slack collaboration tools. Chairman Marc Benioff champions a stakeholder-capitalism ethos and the company’s 1-1-1 philanthropic model of donating equity, products, and employee time. Salesforce Tower dominates the San Francisco skyline and features an Ohana culture emphasizing equality and innovation. The company powers digital transformation for enterprises worldwide and is a component of the Dow Jones Industrial Average.",
        "wikipediaSlug": "Salesforce",
        "isHeadquarters": true
    },
    {
        "name": "Zoom Video Communications",
        "address": "55 Almaden Boulevard, 6th Floor, San Jose, CA 95113",
        "id": "bc4d85b7-7f21-417e-aaff-57737c3897fc",
        "lat": 37.3329888,
        "lng": -121.8951264,
        "imageName": "zoom.us.jpg",
        "description": "Zoom provides cloud-based video meetings, team chat, webinars, and an expanding phone and contact-center platform. Founded in 2011 by former Cisco Webex engineer Eric Yuan, Zoom gained global prominence during the COVID-19 pandemic as remote work and schooling exploded. The company now bills itself as an AI-first communications provider with tools like Zoom AI Companion for meeting summaries. Zoom’s freemium model allows unlimited 40-minute group calls, fostering viral adoption before upselling paid plans. Headquarters remain in Silicon Valley, but the service is used by governments, enterprises, and families worldwide.",
        "wikipediaSlug": "Zoom_Communications",
        "isHeadquarters": true
    },
    {
        "name": "YouTube (Google)",
        "address": "901 Cherry Avenue, San Bruno, CA 94066",
        "id": "e658ef93-c237-4615-82c9-6177a0afd3ab",
        "lat": 37.6282436,
        "lng": -122.4263355,
        "imageName": "youtube.com.jpg",
        "description": "YouTube is the world’s largest video-sharing platform, hosting over two billion logged-in users who watch more than a billion hours of video daily. Founded in 2005 and acquired by Google in 2006 for US $1.65 billion, it now offers ad-supported content, YouTube Premium subscriptions, and live-TV streaming via YouTube TV. Creators monetize through ads, memberships, and merchandise shelves, while YouTube Shorts competes with TikTok for short-form attention. The San Bruno HQ manages policy, trust and safety, and product engineering. YouTube’s influence spans entertainment, education, news, and social movements.",
        "wikipediaSlug": "YouTube",
        "isHeadquarters": true
    },
    {
        "name": "WhatsApp (Meta)",
        "address": "1601 Willow Rd, Menlo Park, CA 94025",
        "id": "b415d311-0e2f-4e70-ad9f-fa3bbf03868b",
        "lat": 37.48451882436818,
        "lng": -122.14729525320755,
        "imageName": "whatsapp.com.jpg",
        "description": "WhatsApp is a free, end-to-end encrypted messaging and calling app used by over two billion people worldwide. Launched in 2009, it was acquired by Facebook (now Meta) in 2014 for approximately US $19 billion, one of the largest tech deals ever. The app supports text, voice, video, group chats, and file sharing, relying on a user’s phone number rather than usernames. WhatsApp Business tools help merchants provide customer support and catalog listings, with future plans for payments in select regions. Privacy-focused features like disappearing messages aim to maintain trust amid encryption debates.",
        "wikipediaSlug": "WhatsApp",
        "isHeadquarters": false
    },
    {
        "name": "Instagram (Meta)",
        "address": "1 Hacker Way Menlo Park, CA ",
        "id": "3f031f9c-f20f-426a-86bf-c536123eaaf3",
        "lat": 37.47976297929931,
        "lng": -122.16891357648237,
        "imageName": "instagram.com.jpg",
        "description": "Instagram is a photo- and video-sharing social network popular for curated images, short Reels, and influencer culture. Launched in 2010 and bought by Facebook for US $1 billion in 2012, it now boasts well over two billion monthly users. Key features include Stories, IGTV, shopping tags, and creator subscriptions that help monetize content. Instagram’s algorithmic feed and explore tab make it a powerful marketing platform for brands and celebrities. Concerns over mental health impacts on teens have pushed the company to add safety and time-management tools.",
        "wikipediaSlug": "Instagram",
        "isHeadquarters": true
    },
    {
        "name": "Fitbit (Google)",
        "address": "199 Fremont Street 14th Floor, San Francisco, CA 94105",
        "id": "9124b928-0ef3-4fd0-a08c-1b8c31820bd9",
        "lat": 37.789873,
        "lng": -122.394781,
        "imageName": "fitbit.com.jpg",
        "description": "Fitbit makes wearable fitness trackers and smartwatches that monitor activity, sleep, heart rate, and more to encourage healthier lifestyles. Founded in 2007, the company went public in 2015 and was acquired by Google in 2021 to bolster its hardware portfolio. Popular devices include the Charge series, Versa watches, and Pixel Watch line that now integrates deeper with Google services. Users engage through the Fitbit app’s social challenges, premium coaching, and wellness insights. Fitbit data has been used in health studies, raising both opportunities and privacy considerations.",
        "wikipediaSlug": "Fitbit",
        "isHeadquarters": true
    },
    {
        "name": "Nest (Google)",
        "address": "3400 Hillview Avenue Palo Alto, CA 94304",
        "id": "92d02355-2ce5-4286-b890-be35618aa2e8",
        "lat": 37.4036507,
        "lng": -122.1476521,
        "imageName": "nest.com.jpg",
        "description": "Google Nest offers smart-home products such as learning thermostats, security cameras, doorbells, speakers, and displays designed for energy savings and convenience. Originally founded as Nest Labs in 2010 by Tony Fadell and Matt Rogers, it was acquired by Google for US $3.2 billion in 2014. Nest products leverage machine learning to adapt to user habits and integrate with Google Assistant for voice control. In 2018 Google unified its smart-home lineup under the Google Nest brand. The devices emphasize sustainability, security, and seamless setup within the Google Home ecosystem.",
        "wikipediaSlug": "Google_Nest",
        "isHeadquarters": true
    },
    {
        "name": "DoorDash",
        "address": "303 2nd Street Suite 800 San Francisco, CA 94107",
        "id": "a865c247-489d-49b2-8125-0feb6133aa0e",
        "lat": 37.7853512,
        "lng": -122.395477,
        "imageName": "doordash.com.jpg",
        "description": "DoorDash is North America’s largest on-demand food-delivery and logistics platform, connecting customers with restaurants, convenience stores, and grocers. Founded in 2013 by Stanford students, it operates in thousands of cities across the U.S., Canada, Australia, and beyond. DoorDash partners with independent “Dashers” who choose flexible shifts and earn delivery fees and tips. Revenue comes from delivery fees, merchant commissions, advertising, and the DashPass subscription offering reduced fees. The company went public in 2020 and is expanding into ultrafast grocery and nationwide shipping.",
        "wikipediaSlug": "DoorDash",
        "isHeadquarters": true
    },
    {
        "name": "Uber",
        "address": "1725 Third Street San Francisco, CA 94158 United States",
        "id": "3e722921-190b-40c8-9312-06b3945399f7",
        "lat": 37.7673722,
        "lng": -122.3887739,
        "imageName": "uber.com.jpg",
        "description": "Uber Technologies began as a ride-hailing app in 2009 and has evolved into a global multimodal mobility and delivery platform. Users can book cars, scooters, shared rides, or order food via Uber Eats and groceries via Uber Direct in over 70 countries. The company uses dynamic pricing and a two-sided marketplace that matches riders with independent driver-partners. Uber invests in autonomous-vehicle research and freight logistics to diversify beyond rides. Regulatory challenges and driver classification debates continue as it pursues profitability.",
        "wikipediaSlug": "Uber",
        "isHeadquarters": true
    },
    {
        "name": "Lyft",
        "address": "185 Berry St Suite 400, San Francisco, CA 94107",
        "id": "94154955-5778-444e-84e0-33fc0b613d72",
        "lat": 37.7765663,
        "lng": -122.3920774,
        "imageName": "lyft.com.jpg",
        "description": "Lyft offers ride-hailing, rental bikes and scooters, and car rentals primarily in the United States and Canada. Founded in 2012 as a spinoff of Zimride, Lyft brands itself on friendliness and pink mustache imagery to differentiate from Uber. Drivers use their own cars and earn flexible income while passengers enjoy on-demand rides through the app. Revenue comes from trip commissions and subscription products like Lyft Pink for frequent riders. The company is exploring autonomous-vehicle partnerships to lower costs and improve safety.",
        "wikipediaSlug": "Lyft",
        "isHeadquarters": true
    },
    {
        "name": "Pinterest",
        "address": "651 Brannan Street San Francisco, CA 94107 United States",
        "id": "30558fb6-5752-4b69-8e00-5c4bf4f6e892",
        "lat": 37.7754369,
        "lng": -122.3996287,
        "imageName": "pinterest.com.jpg",
        "description": "Pinterest is a visual-discovery platform where over 500 million monthly users “pin” images and videos to themed boards for inspiration on recipes, fashion, DIY projects, and more. Founded in 2010, the site functions like a digital scrapbook and drives significant referral traffic to e-commerce sites. Pinterest monetizes through visual search advertising and shoppable product pins. Its positive, planning-oriented community distinguishes it from other social networks. Recent features include AI-powered style matching and creator-led Idea Pins.",
        "wikipediaSlug": "Pinterest",
        "isHeadquarters": true
    },
    {
        "name": "Dropbox",
        "address": "1800 Owens St, San Francisco, CA 94158",
        "id": "539172cf-d6f8-4f25-a1f4-81452819de82",
        "lat": 37.76511170000001,
        "lng": -122.39269,
        "imageName": "dropbox.com.jpg",
        "description": "Dropbox provides cloud storage, file synchronization, and collaborative tools to more than 700 million registered users. Founded in 2007 after a forgotten USB drive inspired co-founder Drew Houston, Dropbox pioneered seamless folder syncing across devices. The platform offers Dropbox Paper for document collaboration and integrates with Slack, Zoom, and Microsoft Office. Revenue comes from paid individual and business subscriptions beyond its free 2 GB tier. Dropbox focuses on a “Virtual First” remote-work culture and carbon-neutral operations.",
        "wikipediaSlug": "Dropbox",
        "isHeadquarters": true
    },
    {
        "name": "Slack",
        "address": "500 Howard St, San Francisco, CA 94105",
        "id": "bead80cf-4950-4286-9601-7f4d6f0152f2",
        "lat": 37.7883503,
        "lng": -122.3963764,
        "imageName": "slack.com.jpg",
        "description": "Slack is a business-messaging platform that replaces email with organized channels, direct messages, and app integrations. Launched in 2013 from a failed gaming startup, it quickly became essential for team collaboration thanks to its searchable history and playful design. Slack supports voice/video calls and workflows, integrating with thousands of third-party tools. The company was acquired by Salesforce for US $27.7 billion in 2021, forming the backbone of Salesforce’s digital HQ strategy. Millions of users rely on Slack emojis, bots, and huddles to streamline daily work.",
        "wikipediaSlug": "Slack_Technologies",
        "isHeadquarters": true
    },
    {
        "name": "Reddit",
        "address": "548 Market Street Suite 16093 San Francisco, CA 94104",
        "id": "fae1c3fb-2743-4a1b-93bb-a869cd7aac40",
        "lat": 37.7908517,
        "lng": -122.4006138,
        "imageName": "reddit.com.jpg",
        "description": "Reddit is a vast network of user-created communities (subreddits) covering almost any topic imaginable, from news and science to memes and niche hobbies. Founded in 2005, it brands itself as “the front page of the internet,” with content ranked by community upvotes and comments. Reddit generates revenue through advertising, premium memberships (Reddit Premium), and digital goods such as Reddit Coins. Its open, anonymous culture fosters lively debate and occasional controversy, including the influential r/WallStreetBets stock-trading community. Reddit filed for an IPO in 2024, aiming to scale while preserving its community ethos.",
        "wikipediaSlug": "Reddit",
        "isHeadquarters": true
    },
    {
        "name": "Square (Block)",
        "address": "1455 Market St #600, San Francisco, CA 94103",
        "id": "75e5ff84-0e15-4f6c-b471-cf6827056e1b",
        "lat": 37.7754538,
        "lng": -122.4177334,
        "imageName": "squareup.com.jpg",
        "description": "Block, Inc. (formerly Square) provides financial-services hardware and software that enable small businesses to accept card payments via Square Readers and Square POS systems. Founded in 2009 by Jack Dorsey, it expanded into Cash App peer-to-peer payments, Buy Now Pay Later via Afterpay, and Bitcoin services through TBD and Spiral. The seller ecosystem offers inventory, payroll, and e-commerce tools that integrate with Square terminals. Block rebranded in 2021 to reflect its broader ecosystem beyond point-of-sale. Its business model blends hardware sales, transaction fees, and subscription services.",
        "wikipediaSlug": "Block,_Inc.",
        "isHeadquarters": true
    },
    {
        "name": "Stripe",
        "address": "354 Oyster Point Blvd, South San Francisco, CA 94080",
        "id": "c54bd255-aa80-41fc-8ef0-37a7dec88c39",
        "lat": 37.6622895,
        "lng": -122.383587,
        "imageName": "stripe.com.jpg",
        "description": "Stripe provides online payment processing and financial infrastructure APIs used by millions of internet businesses from startups to Fortune 500 companies. Founded in 2010 by Irish brothers Patrick and John Collison, Stripe simplifies accepting cards, bank debits, and mobile wallets in over 135 currencies. The company has expanded into billing, tax, fraud prevention, lending, and carbon-removal marketplaces. Despite remaining private, Stripe is one of the highest-valued fintech firms, surpassing US $50 billion in 2025. Its developer-friendly documentation and quick integration time are industry benchmarks.",
        "wikipediaSlug": "Stripe,_Inc.",
        "isHeadquarters": true
    },
    {
        "name": "Robinhood",
        "address": "85 Willow Rd, Menlo Park, CA 94025",
        "id": "7d3977f2-1002-4fb0-bf1a-d1e8496914e8",
        "lat": 37.4545281,
        "lng": -122.1650922,
        "imageName": "robinhood.com.jpg",
        "description": "Robinhood Markets revolutionized retail investing by offering commission-free stock, ETF, options, and crypto trading via a mobile-first app. Founded in 2013, it targets younger investors with intuitive design and no account minimums. Revenue comes from payment for order flow, margin interest, and Robinhood Gold subscriptions. The platform gained notoriety during the 2021 GameStop short squeeze, spotlighting its role in meme-stock culture. Robinhood’s mission is to democratize finance for all, but it faces scrutiny over gamification and outages.",
        "wikipediaSlug": "Robinhood_Markets",
        "isHeadquarters": true
    },
    {
        "name": "Roku",
        "address": "1155 Coleman Ave, San Jose, CA 95110",
        "id": "0eb01df0-c8f9-4ae4-adab-ef3778c7db8d",
        "lat": 37.3529581,
        "lng": -121.9260145,
        "imageName": "roku.com.jpg",
        "description": "Roku builds streaming media players, smart-TV operating systems, and an advertising platform that reaches tens of millions of U.S. households. Founded in 2002, Roku’s affordable sticks and TVs make over-the-top viewing simple, while its Roku Channel offers free, ad-supported content and live TV. Revenue splits roughly between hardware sales and higher-margin platform ads/subscriptions. Roku’s OS partners with TV manufacturers like TCL and Hisense to embed its interface natively. The company competes with Amazon Fire TV, Apple TV, and Google TV in the crowded streaming ecosystem.",
        "wikipediaSlug": "Roku",
        "isHeadquarters": true
    },
    {
        "name": "DocuSign",
        "address": "221 Main St Suite 1550, San Francisco, CA 94105",
        "id": "0e391dc5-cd89-4c2d-9d41-393e0b11d9f7",
        "lat": 37.790344,
        "lng": -122.392177,
        "imageName": "docusign.com.jpg",
        "description": "DocuSign is the market leader in electronic signatures and digital agreement-management solutions, helping organizations automate contract workflows. Founded in 2003, it allows legally binding signatures on virtually any device and complies with eIDAS and U.S. ESIGN acts. The broader DocuSign Agreement Cloud includes CLM, contract analytics, and identity verification services. DocuSign’s APIs integrate with Salesforce, Microsoft 365, and Google Workspace. Millions of users completed more than one billion agreements through the platform as businesses shift to paperless operations.",
        "wikipediaSlug": "Docusign",
        "isHeadquarters": true
    },
    {
        "name": "Atlassian",
        "address": "350 Bush St, Floor 13, San Francisco, CA 94104",
        "id": "4275291e-84df-40ae-8ad2-aa4e0eba8c15",
        "lat": 37.7910081,
        "lng": -122.4033221,
        "imageName": "atlassian.com.jpg",
        "description": "Atlassian develops collaboration and productivity software for software teams, including Jira for project tracking, Confluence for documentation, and Trello for visual boards. Founded in Sydney in 2002, the company pursued a unique no-salesforce, self-service model and later listed on the NASDAQ in 2015. Atlassian’s cloud migration is driving recurring revenue growth, with over 260,000 customers worldwide. Products integrate into DevOps toolchains and are popular among agile development teams. Atlassian champions an open-company, no-BS culture and remote-first work practices.",
        "wikipediaSlug": "Atlassian",
        "isHeadquarters": true
    },
    {
        "name": "GitHub",
        "address": "88 Colin P Kelly Jr St, San Francisco, CA 94107",
        "id": "5000b8a1-af92-49d0-92f7-cdae07dc46cc",
        "lat": 37.7822647,
        "lng": -122.39117,
        "imageName": "github.com.jpg",
        "description": "GitHub hosts the world’s largest code-sharing and collaboration platform, with more than 100 million developers contributing to public and private repositories. Founded in 2008, it popularized Git distributed-version control and offers issue tracking, CI/CD, and security tools. Microsoft acquired GitHub for US $7.5 billion in 2018, keeping it independent and open to all languages and frameworks. GitHub Copilot, powered by OpenAI, uses AI to suggest code, transforming developer productivity. The Octocat mascot symbolizes open-source culture and community.",
        "wikipediaSlug": "GitHub",
        "isHeadquarters": true
    },
    {
        "name": "Box",
        "address": "900 Jefferson Ave, Redwood City, CA 94063",
        "id": "d38bad7f-97fe-496e-84c7-0a0719b3f902",
        "lat": 37.48487,
        "lng": -122.229315,
        "imageName": "box.com.jpg",
        "description": "Box offers secure cloud content management, enabling enterprises to store, share, and collaborate on files with compliance controls and deep integrations. Launched in 2005 by college student Aaron Levie, Box pivoted from consumer to enterprise focus and went public in 2015. Its platform includes Box Sign for e-signatures, Box Shield for data-loss prevention, and Box Relay for workflow automation. The company touts zero-trust architecture and partnerships with Microsoft, Google, and Slack. Box serves heavily regulated industries like healthcare, finance, and government.",
        "wikipediaSlug": "Box_(company)",
        "isHeadquarters": true
    },
    {
        "name": "Evernote",
        "address": "305 Walnut St, Redwood City, CA 94063",
        "id": "06c4cb85-df97-493b-8f71-207369378022",
        "lat": 37.4920771,
        "lng": -122.2224462,
        "imageName": "evernote.com.jpg",
        "description": "Evernote is a note-taking and information-organization app that allows users to capture ideas, web clippings, documents, and tasks across devices. Founded in 2008, it pioneered cloud-synced notebooks with powerful search and tagging. Monetization comes from premium subscriptions offering offline access, increased storage, and collaboration features. In 2023, Evernote was acquired by Italian company Bending Spoons to revitalize growth. Competitors include Microsoft OneNote, Notion, and Google Keep.",
        "wikipediaSlug": "Evernote",
        "isHeadquarters": true
    },
    {
        "name": "Fortinet",
        "address": "899 Kifer Rd, Sunnyvale, CA 94086",
        "id": "e14d73dc-9b77-4315-8b32-214533a675fc",
        "lat": 37.3756011,
        "lng": -122.0112969,
        "imageName": "fortinet.com.jpg",
        "description": "Fortinet develops cybersecurity solutions such as next-generation firewalls, secure SD-WAN, and endpoint protection, all unified by its FortiOS operating system. Founded in 2000 by brothers Ken and Michael Xie, the company’s ASIC-accelerated FortiGate firewalls deliver high performance at lower cost. The Fortinet Security Fabric integrates network, cloud, and IoT security under a single management console. Training services like the NSE certification program address the global cyber-skills gap. Fortinet is publicly traded (FTNT) and services enterprises, service providers, and governments worldwide.",
        "wikipediaSlug": "Fortinet",
        "isHeadquarters": true
    },
    {
        "name": "Juniper Networks",
        "address": "1133 Innovation Way, Sunnyvale, CA 94089",
        "id": "7c6459be-d21e-4f88-a0f5-08375c1e1394",
        "lat": 37.4075369,
        "lng": -122.0293769,
        "imageName": "juniper.net.jpg",
        "description": "Juniper Networks designs high-performance networking hardware, software, and security solutions for service providers, enterprises, and cloud operators. Its MX routers, QFX switches, and Mist AI-driven Wi-Fi compete with Cisco in backbone and data-center deployments. Founded in 1996, Juniper introduced ASIC-based routers that accelerated internet traffic in the dot-com era. The company now emphasizes AI-driven networking and experience-first management through its Mist acquisition. Juniper’s Contrail software supports multicloud orchestration and network virtualization.",
        "wikipediaSlug": "Juniper_Networks",
        "isHeadquarters": true
    },
    {
        "name": "Arista Networks",
        "address": "5453 Great America Pkwy, Santa Clara, CA 95054",
        "id": "c247826e-6b6d-4e9f-a27b-2fda5e4f4d02",
        "lat": 37.4119567,
        "lng": -121.9761527,
        "imageName": "arista.com.jpg",
        "description": "Arista Networks supplies cloud-scale data-center switches and routers built on its Extensible Operating System (EOS). Founded in 2004 by former Cisco execs Andy Bechtolsheim and Jayshree Ullal, Arista became a preferred vendor for hyperscale clouds and financial-trading networks requiring low latency. Its 400G and 800G platforms power AI clusters, and Arista CloudVision provides centralized automation and telemetry. The company’s open-standards approach and high-reliability silicon have driven rapid market-share gains. Arista is headquartered in Santa Clara with R&D in India and Canada.",
        "wikipediaSlug": "Arista_Networks",
        "isHeadquarters": true
    },
    {
        "name": "Seagate Technology",
        "address": "47488 Kato Rd, Fremont, CA 94538",
        "id": "f6b39c71-6f77-405b-b0e8-06e105b38baf",
        "lat": 37.4769034,
        "lng": -121.9306374,
        "imageName": "seagate.com.jpg",
        "description": "Seagate is a leading manufacturer of hard-disk drives (HDDs) and storage-solutions provider for data centers, PCs, and consumer electronics. Founded in 1979, Seagate shipped the first 5.25-inch HDD and continues to push capacity using Heat-Assisted Magnetic Recording (HAMR) technology. The company’s Lyve cloud and edge storage services offer subscription-based data management. Seagate competes with Western Digital and Toshiba in the HDD market while collaborating on open-source storage initiatives. Headquarters are in Fremont, California, with manufacturing in the U.S. and Asia.",
        "wikipediaSlug": "Seagate_Technology",
        "isHeadquarters": true
    },
    {
        "name": "Logitech",
        "address": "7700 Gateway Blvd, Newark, CA 94560",
        "id": "24c644bf-9ac9-45a6-9b4b-2f1fcfcbe0a5",
        "lat": 37.5391586,
        "lng": -122.0616318,
        "imageName": "logitech.com.jpg",
        "description": "Logitech designs peripherals such as mice, keyboards, webcams, headsets, and gaming gear under the Logitech G, ASTRO, and Blue brands. Founded in 1981 in Switzerland, it pioneered the first commercially successful computer mouse. The company experienced renewed growth by focusing on esports-grade devices, work-from-home webcams, and creator products like StreamCam. Sustainability is central to Logitech’s strategy, with many products now using recycled plastics and carbon-neutral packaging. Logitech International trades on both the SIX Swiss Exchange and NASDAQ (LOGI).",
        "wikipediaSlug": "Logitech",
        "isHeadquarters": true
    },
    {
        "name": "GoPro",
        "address": "3025 Clearview Way, San Mateo, CA 94402",
        "id": "787d5d39-3c47-46ea-9194-a4e6be329acb",
        "lat": 37.5344622,
        "lng": -122.330383,
        "imageName": "gopro.com.jpg",
        "description": "GoPro makes rugged, compact action cameras and accessories that capture immersive footage for sports, travel, and vlogging. Founded by Nick Woodman in 2002, the company popularized wearable POV filming with its HERO lineup. GoPro’s Quik app offers automatic video edits, while GoPro Subscription provides unlimited cloud backup and camera replacement. The firm has ventured into 360° and drone cameras, though the Karma drone was discontinued. User-generated GoPro videos have become iconic across social media and broadcast sports.",
        "wikipediaSlug": "GoPro",
        "isHeadquarters": true
    },
    {
        "name": "Electronic Arts (EA)",
        "address": "209 Redwood Shores Pkwy, Redwood City, CA 94065",
        "id": "37d41ac1-b780-411b-a4fc-3d8d8cfd29b2",
        "lat": 37.5228593,
        "lng": -122.2536905,
        "imageName": "ea.com.jpg",
        "description": "Electronic Arts is one of the world’s largest video-game publishers, known for franchises like EA Sports FC (formerly FIFA), Madden NFL, The Sims, Apex Legends, and Battlefield. Founded in 1982, EA pioneered treating game developers as “software artists.” The company now focuses on live services, mobile expansion, and EA Play subscription offerings. EA’s Frostbite engine powers many titles, and acquisitions such as Codemasters and Glu Mobile bolster its portfolio. Competitive gaming and in-game purchases drive recurring revenue alongside annual sports releases.",
        "wikipediaSlug": "Electronic_Arts",
        "isHeadquarters": true
    },
    {
        "name": "Zynga",
        "address": "699 8th St, San Francisco, CA 94103",
        "id": "85bf9240-8c3e-4eb3-8183-e72be4f8d0ad",
        "lat": 37.7704556,
        "lng": -122.4041025,
        "imageName": "zynga.com.jpg",
        "description": "Zynga develops social and mobile games such as Words With Friends, FarmVille, and CSR Racing, engaging hundreds of millions of players. Founded in 2007 and named after the co-founder’s bulldog, the company initially thrived on Facebook-based games before shifting to mobile. Zynga monetizes through in-app purchases and advertising. In 2022, it was acquired by Take-Two Interactive for US $12.7 billion to strengthen Take-Two’s mobile presence. The studio focuses on live-ops updates and branded collaborations to retain players.",
        "wikipediaSlug": "Zynga",
        "isHeadquarters": true
    },
    {
        "name": "Super Micro Computer",
        "address": "980 Rock Ave, San Jose, CA 95131",
        "id": "770cacc2-52a7-4e0e-b676-80cced3b326d",
        "lat": 37.3892159,
        "lng": -121.9049216,
        "imageName": "supermicro.com.jpg",
        "description": "Supermicro produces high-performance, energy-efficient servers, storage systems, and motherboards for data centers, cloud, AI, and edge computing. Founded in 1993, the company emphasizes rapid deployment of the latest Intel and AMD processors in modular, “building-block” designs. Its server racks are used by hyperscale and enterprise customers worldwide. Supermicro is investing in green-compute facilities and liquid-cooling solutions to reduce data-center power usage. Headquarters and a large manufacturing campus reside in San Jose, California.",
        "wikipediaSlug": "Super_Micro_Computer",
        "isHeadquarters": true
    },
    {
        "name": "Intuit (TurboTax, QuickBooks)",
        "address": "2700 Coast Ave, Mountain View, CA 94043",
        "id": "0f47819e-5cdb-4245-b6b8-041e3b704309",
        "lat": 37.4306346,
        "lng": -122.0960826,
        "imageName": "intuit.com.jpg",
        "description": "Intuit provides financial-management software including QuickBooks for small-business accounting, TurboTax for tax preparation, and Credit Karma for consumer credit monitoring. Founded in 1983, Intuit popularized user-friendly financial software and has transitioned to cloud-based SaaS offerings. Its Mailchimp acquisition added marketing automation to the ecosystem. Intuit uses AI under the umbrella of “Intuit Assist” to deliver personalized advice and automation. The company’s products aim to help consumers and small businesses prosper by simplifying money matters.",
        "wikipediaSlug": "Intuit",
        "isHeadquarters": true
    },
    {
        "name": "Genentech",
        "address": "1 DNA Way, South San Francisco, CA 94080",
        "id": "a76e6873-7e63-42e1-a3bf-4213ed0cfb97",
        "lat": 37.6566481,
        "lng": -122.378031,
        "imageName": "gene.com.jpg",
        "description": "Genentech, a member of the Roche Group, is a pioneering biotechnology company credited with commercializing recombinant DNA therapeutics. Founded in 1976, it developed breakthrough drugs like Rituxan for cancer and Pulmozyme for cystic fibrosis. The company’s research campus in South San Francisco is a major hub for oncology, immunology, and neuroscience innovation. Genentech’s patient-assistance programs and science education outreach reflect its mission to do now what patients need next. Roche completed its full acquisition of Genentech in 2009, maintaining the brand and research independence.",
        "wikipediaSlug": "Genentech",
        "isHeadquarters": true
    },
    {
        "name": "Gilead Sciences",
        "address": "333 Lakeside Dr, Foster City, CA 94404",
        "id": "51a55aa2-17c5-4399-90af-c3a43175ea27",
        "lat": 37.5669823,
        "lng": -122.2816625,
        "imageName": "gilead.com.jpg",
        "description": "Gilead Sciences is a biopharmaceutical company best known for antiviral therapies treating HIV, hepatitis C, and COVID-19. Founded in 1987, Gilead revolutionized HCV care with curative drugs Harvoni and Sovaldi and produces Truvada and Biktarvy for HIV prevention and treatment. The company expanded into oncology with its 2020 acquisition of Immunomedics and CAR-T developer Kite Pharma. Gilead’s headquarters overlook a man-made lake in Foster City, symbolizing its Bay Area biotech roots. Access programs aim to widen availability of lifesaving antivirals in low-income countries.",
        "wikipediaSlug": "Gilead_Sciences",
        "isHeadquarters": true
    },
    {
        "name": "23andMe",
        "address": "223 N Mathilda Ave, Sunnyvale, CA 94086",
        "id": "cc30672b-4417-45e8-9fbd-dbf37deab3ef",
        "lat": 37.3827896,
        "lng": -122.0335455,
        "imageName": "23andme.com.jpg",
        "description": "23andMe offers direct-to-consumer genetic testing kits that provide ancestry insights and health-risk reports based on DNA analysis. Founded in 2006, it became the first company to receive FDA authorization to market such tests without a prescription. Data from consenting customers supports drug-discovery partnerships, including a multi-year collaboration with GlaxoSmithKline. In 2021, 23andMe went public via SPAC, emphasizing its dual role as a consumer brand and biotech-research platform. Privacy policies and data-sharing transparency are core to customer trust.",
        "wikipediaSlug": "23andMe",
        "isHeadquarters": true
    },
    {
        "name": "OpenAI",
        "address": "1455 3rd Street San Francisco, CA 94158",
        "id": "7dfe8cc1-44ab-4ef7-bbdf-3885d23ac13d",
        "lat": 37.7700936,
        "lng": -122.3889942,
        "imageName": "openai.com.jpg",
        "description": "OpenAI researches and deploys artificial general intelligence (AGI) that benefits all of humanity, best known for language models like ChatGPT and DALL-E image generation. Founded in 2015 as a non-profit, it created a capped-profit structure to fund massive compute needs while aligning with its mission. Microsoft is OpenAI’s primary cloud partner and investor, integrating models into Azure and Copilot products. OpenAI’s API allows businesses to build generative-AI applications for code, content, and data analysis. The organization advocates for responsible AI governance and safety research.",
        "wikipediaSlug": "OpenAI",
        "isHeadquarters": true
    },
    {
        "name": "Anthropic",
        "address": "548 Market St, San Francisco, CA 94104",
        "id": "aa1d0d00-bbc7-4ab5-9cbd-f203bf573748",
        "lat": 37.7908517,
        "lng": -122.4006138,
        "imageName": "anthropic.com.jpg",
        "description": "Anthropic is an AI-safety-focused research company developing large language models under the Claude family, emphasizing constitutional AI and alignment. Founded in 2021 by former OpenAI researchers Dario and Daniela Amodei, the startup has secured billions in funding from Google and AWS. Anthropic aims to create reliable, steerable, and interpretable AI systems to mitigate risks of misinformation and misuse. Its Claude models power chat assistants and enterprise knowledge tools via API and integrations. The company publishes safety research and collaborates on policy initiatives.",
        "wikipediaSlug": "Anthropic",
        "isHeadquarters": true
    },
    {
        "name": "Lam Research",
        "address": "4650 Cushing Pkwy, Fremont, CA 94538",
        "id": "2c99091c-11e3-4920-8786-353e8bb80fc9",
        "lat": 37.4885263,
        "lng": -121.9570265,
        "imageName": "lamresearch.com.jpg",
        "description": "Lam Research supplies wafer-fabrication equipment and services critical to producing advanced semiconductor devices. Its plasma-etch and deposition tools enable chipmakers like TSMC, Samsung, and Intel to pattern nanoscale transistor structures. Founded in 1980, Lam plays a pivotal role in scaling Moore’s Law by introducing atomic-layer processes and EUV-compatible chambers. The company invests heavily in R&D and a global network of customer engineering centers. Semiconductor equipment cycles make Lam’s revenue sensitive to foundry capital-expenditure trends.",
        "wikipediaSlug": "Lam_Research",
        "isHeadquarters": true
    },
    {
        "name": "KLA Corporation",
        "address": "1 Technology Dr, Milpitas, CA 95035",
        "id": "c2a4aa0c-3ef8-46e4-9a76-ee36ae74719e",
        "lat": 37.4213037,
        "lng": -121.9240275,
        "imageName": "kla.com.jpg",
        "description": "KLA develops process-control and yield-management systems that inspect and measure silicon wafers and chips during semiconductor fabrication. Its optical and e-beam inspection tools detect defects at nanometer scales, helping manufacturers improve yields and reduce costs. Formed by the 1997 merger of KLA Instruments and Tencor, the company now integrates AI to analyze vast inspection data. KLA’s metrology equipment is essential for advanced-node production, competing with companies like Applied Materials and ASML. The Milpitas campus includes a state-of-the-art cleanroom and training center.",
        "wikipediaSlug": "KLA_Corporation",
        "isHeadquarters": true
    },
    {
        "name": "Marvell Technology",
        "address": "5488 Marvell Ln, Santa Clara, CA 95054",
        "id": "4944055c-eb37-4b23-aea7-ed7745774ff8",
        "lat": 37.4116952,
        "lng": -121.982038,
        "imageName": "marvell.com.jpg",
        "description": "Marvell designs data-infrastructure semiconductor solutions, including networking, storage, and custom ASICs for cloud, 5G, and automotive markets. Founded in 1995, Marvell reinvented itself through acquisitions like Cavium and Innovium and a focus on high-speed Ethernet and PAM4 optical DSPs. Its custom silicon unit collaborates with hyperscale cloud providers on AI accelerators and security chips. Marvell’s portfolio targets bandwidth-hungry workloads and edge-to-cloud connectivity. Headquarters reside in Santa Clara, with R&D centers worldwide.",
        "wikipediaSlug": "Marvell_Technology",
        "isHeadquarters": true
    },
    {
        "name": "Nutanix",
        "address": "1740 Technology Dr, San Jose, CA 95110",
        "id": "7cd49109-6ecc-4fbf-8b80-bf32748105b5",
        "lat": 37.3676689,
        "lng": -121.9181011,
        "imageName": "nutanix.com.jpg",
        "description": "Nutanix pioneered hyperconverged infrastructure (HCI), combining compute, storage, and networking into a single software-defined platform that runs on industry-standard servers. Founded in 2009, its Acropolis OS and Prism management simplify data-center operations and enable hybrid cloud deployments. Nutanix has transitioned to a subscription-licensed software model and partners closely with HPE, Lenovo, and Dell. Its clusters host enterprise workloads, virtual desktops, and Kubernetes containers. The company is expanding into database-as-a-service and cloud-native management.",
        "wikipediaSlug": "Nutanix",
        "isHeadquarters": true
    },
    {
        "name": "Pure Storage",
        "address": "650 Castro St #400, Mountain View, CA 94041",
        "id": "f79f9101-9606-487c-bdeb-81da31e4d95f",
        "lat": 37.3878672,
        "lng": -122.0830261,
        "imageName": "purestorage.com.jpg",
        "description": "Pure Storage delivers all-flash data storage arrays and subscription services that replace legacy spinning disks with faster, more energy-efficient NVMe media. Founded in 2009, Pure’s Evergreen and Pure-as-a-Service models provide non-disruptive upgrades and OPEX flexibility. Its FlashArray and FlashBlade lines support databases, analytics, AI, and unstructured data workloads. Pure’s unique DirectFlash architecture reduces latency and improves endurance. The company emphasizes sustainability by touting power savings compared to traditional storage.",
        "wikipediaSlug": "Pure_Storage",
        "isHeadquarters": true
    },
    {
        "name": "Splunk",
        "address": "270 Brannan St, San Francisco, CA 94107",
        "id": "6f9533bb-5ec4-435f-8220-1a930250b191",
        "lat": 37.782784,
        "lng": -122.3913852,
        "imageName": "splunk.com.jpg",
        "description": "Splunk provides a platform for collecting, indexing, and analyzing machine-generated data to deliver observability and cybersecurity insights. Its core product turns logs and metrics into dashboards, alerts, and AI-driven analytics. Founded in 2003, Splunk coined the term “Google for machine data” and now serves DevOps, IT, and security teams. Splunk transitioned to cloud subscriptions and was acquired by Cisco in 2024 to bolster its security and observability portfolio. Customers use Splunk to monitor applications, detect threats, and ensure compliance.",
        "wikipediaSlug": "Splunk",
        "isHeadquarters": true
    },
    {
        "name": "RingCentral",
        "address": "20 Davis Dr, Belmont, CA 94002",
        "id": "b8c64dfd-ed3e-445c-b08e-a945826c88eb",
        "lat": 37.5108949,
        "lng": -122.3065331,
        "imageName": "ringcentral.com.jpg",
        "description": "RingCentral offers cloud-based unified-communications-as-a-service (UCaaS) including business phone, video meetings, team messaging, and contact-center solutions. Founded in 1999, RingCentral displaced legacy PBX systems with its VoIP and mobile apps. The company partners with Avaya and Mitel to migrate on-prem customers to the cloud. RingCentral’s MVP platform integrates with Microsoft Teams, Salesforce, and hundreds of other apps. Predictive analytics and AI-powered transcriptions enhance productivity and customer engagement.",
        "wikipediaSlug": "RingCentral",
        "isHeadquarters": true
    },
    {
        "name": "Sumo Logic",
        "address": "855 Main St #100, Redwood City, CA 94063",
        "id": "a2e91176-f514-45ef-a59b-c555ee8b6884",
        "lat": 37.4855756,
        "lng": -122.2259889,
        "imageName": "sumologic.com.jpg",
        "description": "Sumo Logic delivers cloud-native log management and security analytics as a multi-tenant SaaS platform. Founded in 2010, it helps DevSecOps teams monitor application performance, troubleshoot incidents, and detect threats in real time. The platform leverages machine learning to provide anomaly detection and predictive insights. Sumo Logic supports structured and unstructured data from AWS, Azure, Kubernetes, and more. In 2023, the company was taken private by Francisco Partners to accelerate growth in cybersecurity and observability.",
        "wikipediaSlug": "Sumo_Logic",
        "isHeadquarters": true
    },
    {
        "name": "Five9",
        "address": "3001 Bishop Dr #350, San Ramon, CA 94583",
        "id": "695c6e29-953c-4324-ba24-174bf3c1eae3",
        "lat": 37.7644739,
        "lng": -121.9621458,
        "imageName": "five9.com.jpg",
        "description": "Five9 provides cloud contact-center software that enables businesses to deliver omnichannel customer service via voice, chat, email, and social media. Founded in 2001, it replaced legacy on-premise call centers with scalable, AI-powered solutions. Five9’s Intelligent Cloud Contact Center integrates with CRM systems like Salesforce and uses predictive dialing and speech analytics. A proposed acquisition by Zoom in 2021 fell through, but the two companies remain strategic partners. Five9 serves enterprises in retail, healthcare, finance, and outsourcing.",
        "wikipediaSlug": "Five9",
        "isHeadquarters": true
    },
    {
        "name": "Coupa Software",
        "address": "1855 S Grant St, San Mateo, CA 94402",
        "id": "36655442-6030-453d-acaa-8ec90b720135",
        "lat": 37.5534964,
        "lng": -122.2995154,
        "imageName": "coupa.com.jpg",
        "description": "Coupa delivers cloud spend-management software that helps organizations control procurement, invoicing, and expenses on a single platform. Founded in 2006, Coupa emphasizes “Value as a Service,” tracking customer savings and ROI. The platform uses community intelligence data and AI to benchmark pricing and flag compliance issues. In 2023, private-equity firm Thoma Bravo acquired Coupa for US $8 billion, taking it private to accelerate innovation. Customers across industries use Coupa to gain visibility and automate business spend.",
        "wikipediaSlug": "Coupa",
        "isHeadquarters": true
    },
    {
        "name": "Bill.com",
        "address": "6220 America Center Dr #100, San Jose, CA 95002",
        "id": "d63c694d-5ed4-4063-ae2b-9fe4912dced7",
        "lat": 37.4185226,
        "lng": -121.9784034,
        "imageName": "bill.com.jpg",
        "description": "Bill.com automates accounts-payable and accounts-receivable workflows for small and mid-size businesses, streamlining invoice capture, approvals, payments, and reconciliation. Founded in 2006, it integrates with QuickBooks, Xero, NetSuite, and major banks. The company expanded into expense management with its acquisition of Divvy and into cross-border payments via international wires. Bill.com earns revenue from software subscriptions and transaction fees. Its AI-enabled Intelligent Virtual Assistant extracts invoice data and matches it to purchase orders.",
        "wikipediaSlug": "Bill.com",
        "isHeadquarters": true
    },
    {
        "name": "Nextdoor",
        "address": "420 Taylor St, San Francisco, CA 94102",
        "id": "5d025e1d-5ec3-4b6c-bae9-766a1870616a",
        "lat": 37.7864553,
        "lng": -122.4111101,
        "imageName": "nextdoor.com.jpg",
        "description": "Nextdoor is a social-networking app for neighborhoods, where verified residents share local news, recommendations, and community alerts. Launched in 2011, it operates in 11 countries and partners with public agencies for emergency communications. Businesses use Nextdoor Ads and free Business Pages to reach nearby customers. The company went public via SPAC in 2021 under the ticker KIND. Privacy is reinforced through address verification, though moderation challenges persist.",
        "wikipediaSlug": "Nextdoor",
        "isHeadquarters": true
    },
    {
        "name": "Instacart",
        "address": "50 Beale St #600, San Francisco, CA 94105",
        "id": "87f6f96c-e676-48e2-a84f-89d5173682b6",
        "lat": 37.791302,
        "lng": -122.3963906,
        "imageName": "instacart.com.jpg",
        "description": "Instacart operates a grocery-delivery and pick-up marketplace, connecting shoppers with retailers like Kroger, Costco, and Walmart across North America. Founded in 2012 by Apoorva Mehta, the platform uses a network of gig-economy shoppers to fulfill orders. Revenue comes from delivery fees, Instacart + subscriptions, and a growing retail-media advertising business. Instacart went public in 2023 under the ticker CART. The company is expanding into software services that power grocers’ own e-commerce sites.",
        "wikipediaSlug": "Instacart",
        "isHeadquarters": true
    },
    {
        "name": "Chime",
        "address": "77 Maiden Ln, San Francisco, CA 94108",
        "id": "d40e3c43-0f85-4fd0-86d1-37c97092a6a8",
        "lat": 37.7882562,
        "lng": -122.4046581,
        "imageName": "chime.com.jpg",
        "description": "Chime is a neobank offering fee-free checking accounts, savings, and secured credit-builder cards through partnerships with FDIC-insured banks. Founded in 2012, it targets millennials underserved by traditional banks, highlighting no overdraft fees and early paycheck access. The Chime app provides real-time transaction alerts and automatic savings features. Revenue primarily comes from interchange fees on debit-card transactions. Chime remains privately held and one of the most valuable U.S. fintech startups.",
        "wikipediaSlug": "Chime_(company)",
        "isHeadquarters": true
    },
    {
        "name": "SoFi",
        "address": "234 1st St, San Francisco, CA 94105",
        "id": "4d4f5635-ed3a-4440-95e4-36f34ca3a514",
        "lat": 37.7877665,
        "lng": -122.3957115,
        "imageName": "sofi.com.jpg",
        "description": "SoFi Technologies began as a student-loan refinancer in 2011 and evolved into a one-stop financial-services app offering personal loans, mortgages, stock and crypto trading, credit cards, and banking. It obtained a U.S. bank charter in 2022 after acquiring Golden Pacific Bancorp. SoFi Stadium naming rights boosted brand recognition through NFL and major events. The company targets digitally native consumers with educational content and community resources. SoFi’s Galileo subsidiary provides payments-processing APIs to other fintechs.",
        "wikipediaSlug": "SoFi",
        "isHeadquarters": true
    },
    {
        "name": "Affirm",
        "address": "650 California St, San Francisco, CA 94108",
        "id": "742066bd-3da9-4920-84a9-ee63cdcbfddb",
        "lat": 37.7929223,
        "lng": -122.405241,
        "imageName": "affirm.com.jpg",
        "description": "Affirm offers Buy Now Pay Later financing that lets consumers split purchases into installment payments with transparent terms and no late fees. Founded in 2012 by PayPal co-founder Max Levchin, Affirm partners with merchants like Amazon, Shopify, and Peloton to boost conversion and average order value. Affirm Card extends BNPL flexibility to everyday purchases. The company earns revenue from merchant fees and interest on longer-term loans. Critics monitor the impact of BNPL on consumer debt, prompting increased regulation.",
        "wikipediaSlug": "Affirm",
        "isHeadquarters": true
    },
    {
        "name": "Plaid",
        "address": "123 Mission St #900, San Francisco, CA 94105",
        "id": "fb643bb5-e75f-4f79-9625-e332b241bec7",
        "lat": 37.7917585,
        "lng": -122.394398,
        "imageName": "plaid.com.jpg",
        "description": "Plaid provides APIs that let fintech apps connect securely to customers’ bank accounts for payments, identity, and financial-data aggregation. Founded in 2013, Plaid underpins services like Venmo, Robinhood, and Chime. A $5.3 billion acquisition by Visa was blocked by regulators in 2021, after which Plaid raised funding independently. The company is expanding into payroll data, credit underwriting, and open-banking initiatives. Plaid’s mission is to unlock financial freedom for everyone by powering modern digital finance.",
        "wikipediaSlug": "Plaid_(company)",
        "isHeadquarters": true
    },
    {
        "name": "Carta",
        "address": "333 Bush St, San Francisco, CA 94104",
        "id": "d161c28f-b73c-4c85-ab97-1c3fc721f8da",
        "lat": 37.7907897,
        "lng": -122.4031102,
        "imageName": "carta.com.jpg",
        "description": "Carta manages cap tables, valuations, and equity plans for private and public companies, making ownership more transparent. Founded in 2012, it digitized paper stock certificates and simplified issuing option grants to employees. Carta’s platform hosts secondary share sales through CartaX and provides fund-administration services for VCs. The company advocates for broader employee equity and publishes an annual State of Private Markets report. Privacy concerns and market fluctuations challenge its expansion into trading.",
        "wikipediaSlug": "Carta_(software)",
        "isHeadquarters": true
    },
    {
        "name": "Brex",
        "address": "405 Howard Street Floor 2 San Francisco, CA 94105",
        "id": "274a4c1c-f12c-44a8-b989-4ba0c4076c2b",
        "lat": 37.7886088,
        "lng": -122.3953756,
        "imageName": "brex.com.jpg",
        "description": "Brex offers corporate cards, spend-management software, and venture debt tailored to startups and fast-growing businesses. Launched in 2017 by Brazilian founders, Brex uses real-time underwriting to provide high limits without personal guarantees. It expanded into business banking and global expense management through its Empower platform. Brex rewards points can be redeemed for travel, crypto, or statement credits. In 2024 the company shifted focus to larger tech and mid-market customers, pausing services for smaller SMBs.",
        "wikipediaSlug": "Brex",
        "isHeadquarters": true
    },
    {
        "name": "Gusto",
        "address": "525 20th St, San Francisco, CA 94107",
        "id": "e01c2774-e659-4576-a15e-f05e9c40db18",
        "lat": 37.7598766,
        "lng": -122.3860163,
        "imageName": "gusto.com.jpg",
        "description": "Gusto provides cloud payroll, HR, and benefits administration to over 300,000 small- and medium-sized businesses in the United States. Founded in 2011 as ZenPayroll, it automates tax filings, direct deposits, and compliance. Gusto Wallet offers employees budgeting tools and early wage access. The platform integrates with accounting and time-tracking apps, delivering a one-stop HR solution. Gusto prioritizes employee experience and transparent pricing over traditional payroll providers.",
        "wikipediaSlug": "Gusto_(company)",
        "isHeadquarters": true
    },
    {
        "name": "Blend Labs",
        "address": "415 Kearny St, San Francisco, CA 94108",
        "id": "86dd3a4f-4aef-45fc-b85b-c450abd2633b",
        "lat": 37.7918954,
        "lng": -122.4045358,
        "imageName": "blend.com.jpg",
        "description": "Blend provides digital-lending software that streamlines mortgage, consumer-loan, and deposit-account origination for banks and credit unions. Founded in 2012, Blend’s white-label platform powers applications for Wells Fargo, U.S. Bank, and other major lenders. It leverages data connectivity to prefill forms and verify income quickly, reducing application friction. Blend went public in 2021 but faces mortgage-market cycles that affect revenue. The company is expanding into identity verification and home-equity products.",
        "wikipediaSlug": "Blend_Labs",
        "isHeadquarters": true
    },
    {
        "name": "Upstart",
        "address": "2950 S Delaware St, San Mateo, CA 94403",
        "id": "57f6df70-3c67-44c4-afd6-ef5191010108",
        "lat": 37.5413944,
        "lng": -122.2997062,
        "imageName": "upstart.com.jpg",
        "description": "Upstart is an AI-driven lending platform that partners with banks to offer personal loans, auto refinancing, and small-business loans. Founded by former Google execs in 2012, it uses alternative data like education and employment to assess creditworthiness. Upstart’s model aims to expand credit access to thin-file borrowers while maintaining low default rates. The company operates as a loan marketplace, selling most originations to bank partners or capital markets. Economic conditions and funding-cost swings influence loan volumes.",
        "wikipediaSlug": "Upstart_(company)",
        "isHeadquarters": true
    },
    {
        "name": "Mashgin",
        "address": "3500 Edison Way, Menlo Park, CA 94025",
        "id": "f6abd630-8f76-46cc-8d9e-feebb9c29314",
        "lat": 37.4766319,
        "lng": -122.1969753,
        "imageName": "mashgin.com.jpg",
        "description": "Mashgin builds AI-powered self-checkout kiosks that use computer vision to identify multiple items instantly without barcodes. Founded in 2013, the system is deployed in stadiums, cafeterias, and convenience stores to reduce wait times. Customers place items on the tray, see the total, and pay in seconds. Mashgin reports average transaction times under 15 seconds and increased throughput for merchants. The company competes with Amazon Just Walk Out and other cashierless technologies.",
        "wikipediaSlug": "Mashgin",
        "isHeadquarters": true
    },
    {
        "name": "Figma",
        "address": "760 Market St, Floor 5, San Francisco, CA 94102",
        "id": "730e4b2a-39a8-4043-adf3-6c23ba0a8197",
        "lat": 37.7861007,
        "lng": -122.4056342,
        "imageName": "figma.com.jpg",
        "description": "Figma offers a browser-based interface-design and collaboration platform that allows teams to co-design in real time, replacing desktop tools like Sketch. Founded in 2012, its multiplayer editing, component libraries, and design-system features have made it a favorite among product designers. Figma Community lets users share and remix templates and plugins. Adobe announced a $20 billion acquisition in 2022, but antitrust regulators blocked the deal in 2024. Figma continues to expand with FigJam online whiteboards and DevMode handoff tools.",
        "wikipediaSlug": "Figma",
        "isHeadquarters": true
    },
    {
        "name": "Notion Labs",
        "address": "2300 Harrison St, San Francisco, CA 94110",
        "id": "1cb9d2b1-0352-483e-bb9b-13d3a12f5df4",
        "lat": 37.76039,
        "lng": -122.4131897,
        "imageName": "notion.so.jpg",
        "description": "Notion is an all-in-one workspace for notes, databases, project management, and wikis, used by individuals and teams to organize information flexibly. Launched in 2016, Notion’s block-based pages allow drag-and-drop customization without coding. The tool’s templates and integrations support use cases from personal journaling to company knowledge bases. Notion AI assists with writing, summarizing, and task creation. The company remains privately funded and profitable, with a vibrant community and marketplace ecosystem.",
        "wikipediaSlug": "Notion_(productivity_software)",
        "isHeadquarters": true
    },
    {
        "name": "Airtable",
        "address": "799 Market St, San Francisco, CA 94103",
        "id": "6719637c-d43a-4a16-af57-fdc97e4a6225",
        "lat": 37.7856544,
        "lng": -122.4052753,
        "imageName": "airtable.com.jpg",
        "description": "Airtable combines the familiarity of spreadsheets with the power of relational databases to let users build custom workflow apps without code. Founded in 2012, Airtable Base can track projects, inventory, or content calendars and syncs across views like grid, kanban, and timeline. The platform supports scripting, automation, and an extensive marketplace of extensions. Enterprise adoption has grown through data-governance and connected-apps features. Airtable is used by marketing teams, product managers, and non-technical builders worldwide.",
        "wikipediaSlug": "Airtable",
        "isHeadquarters": true
    },
    {
        "name": "Zapier",
        "address": "548 Market St #62411, San Francisco, CA 94104",
        "id": "f0f0a9c3-0036-4902-b5c9-68a9b7d0fe99",
        "lat": 37.7908517,
        "lng": -122.4006138,
        "imageName": "zapier.com.jpg",
        "description": "Zapier is a no-code automation platform enabling users to connect over 6,000 web apps and automate workflows called “Zaps.” Founded in 2011, it allows small businesses and individuals to transfer data and trigger actions without developer resources. Zapier’s freemium model scales to paid tiers offering multi-step Zaps, premium apps, and advanced features. The fully remote company is bootstrapped and profitable, often cited as a leader in the no-code movement. AI-powered Zap creation and “Interfaces” micro-apps extend its automation capabilities.",
        "wikipediaSlug": "Zapier",
        "isHeadquarters": true
    },
    {
        "name": "Miro",
        "address": "201 Mission St #2900, San Francisco, CA 94105",
        "id": "ecb35769-d0c0-4f73-9406-161e2d0820bb",
        "lat": 37.7914374,
        "lng": -122.3950694,
        "imageName": "miro.com.jpg",
        "description": "Miro offers an online collaborative whiteboard used by distributed teams for brainstorming, agile planning, and diagramming. Founded in 2011 (as RealtimeBoard), Miro surged in popularity during remote-work shifts. The platform features sticky notes, templates, and integrations with Slack, Jira, and Zoom. Miroverse hosts community-created templates for design sprints, OKRs, and user-journey maps. The company is headquartered in Amsterdam and San Francisco, serving over 60 million users.",
        "wikipediaSlug": "Miro_(software)",
        "isHeadquarters": true
    },
    {
        "name": "Unity Technologies",
        "address": "657 Mission St, San Francisco, CA 94105",
        "id": "08d5d35f-c43d-4e44-b900-1ca468b40c2c",
        "lat": 37.7867095,
        "lng": -122.4008276,
        "imageName": "unity.com.jpg",
        "description": "Unity develops a real-time 3D game engine and development platform used in over half of the world’s mobile and VR games. Founded in Denmark in 2004, Unity democratized game creation with an accessible engine and asset store. Beyond gaming, Unity powers simulations in automotive, film, architecture, and digital twins. The company monetizes through software subscriptions, advertising (Unity Ads), and in-game purchases. A 2023 merger with ironSource expanded Unity’s ad-tech capabilities amid competition with Epic Games’ Unreal Engine.",
        "wikipediaSlug": "Unity_(game_engine)",
        "isHeadquarters": true
    },
    {
        "name": "AppLovin",
        "address": "1100 Page Mill Rd, Palo Alto, CA 94304",
        "id": "416bb904-e5d3-4620-9ba6-048511609808",
        "lat": 37.4152188,
        "lng": -122.153139,
        "imageName": "applovin.com.jpg",
        "description": "AppLovin provides a software platform for mobile app developers to acquire users, monetize through advertising, and analyze performance. Founded in 2012, it combines the AppLovin Exchange, MAX mediation, and SparkLabs creative tools. The company owns and operates its own studios, including Machine Zone and Lion Studios, producing games like “Game of War.” AppLovin went public in 2021 and pivoted toward AI-driven ad targeting after privacy changes challenged mobile advertising. It competes with Unity Ads and ironSource in the app-monetization ecosystem.",
        "wikipediaSlug": "AppLovin",
        "isHeadquarters": true
    },
    {
        "name": "Airbnb",
        "address": "888 Brannan St., San Francisco, CA 94103",
        "description": "Home-sharing platform connecting travelers with hosts for unique stays and experiences worldwide.",
        "imageName": "airbnb.com.jpg",
        "id": "57f3c747-a7d2-4103-8a56-db119ddf2c54",
        "lat": 37.7716792,
        "lng": -122.4052001,
        "wikipediaSlug": "Airbnb",
        "isHeadquarters": true
    },
    {
        "name": "Twitch",
        "address": "350 Bush Street, San Francisco, CA 94104",
        "description": "Live streaming platform, primarily for gamers and creative content, acquired by Amazon in 2014.",
        "imageName": "twitch.tv.jpg",
        "id": "e424cea9-d54e-4a24-aa4b-b86a5c9d80c2",
        "lat": 37.7910081,
        "lng": -122.4033221,
        "wikipediaSlug": "Twitch_(service)",
        "isHeadquarters": true
    },
    {
        "name": "Yelp",
        "address": "350 Mission Street, 10th Floor, San Francisco, CA 94105",
        "description": "Reviews and recommendations site for local businesses, restaurants, and services.",
        "imageName": "yelp.com.jpg",
        "id": "860565a1-a001-42c1-8a83-9e60c14d3b73",
        "lat": 37.7908745,
        "lng": -122.396719,
        "wikipediaSlug": "Yelp",
        "isHeadquarters": true
    },
    {
        "name": "Roblox Corporation",
        "address": "3150 South Delaware Street, San Mateo, CA 94403",
        "description": "Online gaming platform and game creation system enabling users to create and play immersive 3D experiences.",
        "imageName": "roblox.com.jpg",
        "id": "b77a9476-4555-4a55-b76e-6bb96d5175ab",
        "lat": 37.5396188,
        "lng": -122.2980869,
        "wikipediaSlug": "Roblox_Corporation",
        "isHeadquarters": true
    },
    {
        "name": "Pixar",
        "address": "1200 Park Ave., Emeryville, CA 94608",
        "description": "Animation studio renowned for pioneering computer-generated feature films such as “Toy Story” and “Inside Out.”",
        "imageName": "pixar.com.jpg",
        "id": "3dbe2b86-d08d-407d-b9cb-54ec7008f040",
        "lat": 37.8329972,
        "lng": -122.284397,
        "wikipediaSlug": "Pixar",
        "isHeadquarters": true
    },
    {
        "name": "Dolby Laboratories",
        "address": "1275 Market St FL 15, San Francisco, CA 94103",
        "description": "Audio technology company specializing in sound and imaging innovations for cinema, home, and mobile devices.",
        "imageName": "dolby.com.jpg",
        "id": "924cbfce-8477-4ec0-b4d9-c7540fdcc0eb",
        "lat": 37.7775176,
        "lng": -122.4157257,
        "wikipediaSlug": "Dolby",
        "isHeadquarters": true
    },
    {
        "name": "Crunchyroll",
        "address": "835 Market St, 7th Floor, San Francisco, CA 94103",
        "description": "Anime streaming service offering a vast library of anime, manga, and Asian dramas.",
        "imageName": "crunchyroll.com.jpg",
        "id": "ba039614-e95c-4e2f-964b-ec47e3b2e52a",
        "lat": 37.7835219,
        "lng": -122.4068262,
        "wikipediaSlug": "Crunchyroll",
        "isHeadquarters": false
    },
    {
        "name": "Niantic",
        "address": "Suite 200, 1 Ferry Building, San Francisco, CA 94111",
        "description": "Developer of augmented reality mobile games including Pokémon GO and Ingress.",
        "imageName": "nianticlabs.com.jpg",
        "id": "eb50ac71-3f21-4814-a1d1-04a9e5ccee63",
        "lat": 37.7967868,
        "lng": -122.3932987,
        "wikipediaSlug": "Niantic,_Inc.",
        "isHeadquarters": true
    },
    {
        "name": "Capcom U.S.A.",
        "address": "800 Concar Drive, Suite 300, San Mateo, CA 94402",
        "description": "U.S. arm of the Japanese video game publisher known for franchises like Street Fighter and Resident Evil.",
        "imageName": "capcom.com.jpg",
        "id": "79d92781-e5b3-4dbe-bdae-be82488e4b59",
        "lat": 37.5549806,
        "lng": -122.3003134,
        "wikipediaSlug": "Capcom",
        "isHeadquarters": true
    },
    {
        "name": "Sony Interactive Entertainment (PlayStation)",
        "address": "2207 Bridgepointe Parkway, San Mateo, CA 94404",
        "description": "Gaming division of Sony, responsible for PlayStation consoles, games, and network services.",
        "imageName": "playstation.com.jpg",
        "id": "86a48335-15cb-4d75-9d80-7d4737c3708b",
        "lat": 37.5616721,
        "lng": -122.2842386,
        "wikipediaSlug": "Sony_Interactive_Entertainment",
        "isHeadquarters": true
    },
    {
        "name": "Industrial Light & Magic",
        "address": "PO Box 29909, San Francisco, CA 94129",
        "description": "Visual effects studio founded by George Lucas, known for groundbreaking effects in film and television.",
        "imageName": "ilm.com.jpg",
        "id": "8b4f7651-92fe-441b-a0ae-cb114abd75ae",
        "lat": 37.7749295,
        "lng": -122.4194155,
        "wikipediaSlug": "Industrial_Light_&_Magic",
        "isHeadquarters": true
    },
    {
        "name": "Lucasfilm Animation",
        "address": "One Letterman Dr, San Francisco, CA 94133",
        "description": "Animation studio producing animated features and series set in the Star Wars universe; based in San Rafael but precise HQ address not confirmed.",
        "imageName": "lucasfilm.com.jpg",
        "id": "d7ee5367-d41a-4558-a049-cf4922f1c10c",
        "lat": 37.7983937,
        "lng": -122.4508838,
        "wikipediaSlug": "Lucasfilm_Animation",
        "isHeadquarters": true
    },
    {
        "name": "Skywalker Sound",
        "address": "Skywalker Ranch, Marin County, CA (exact address not public)",
        "description": "Audio post-production company specializing in sound design and mixing for film, television, and games.",
        "imageName": "skywalkersound.com.jpg",
        "id": "66959b6d-5755-46cb-9b27-3bf1a1b00889",
        "lat": 38.0593845,
        "lng": -122.6543768,
        "wikipediaSlug": "Skywalker_Sound",
        "isHeadquarters": true
    },
    {
        "name": "SurveyMonkey",
        "address": "910 Park Pl Ste 300, San Mateo, CA 94403",
        "description": "Online survey development and cloud-based software company; HQ in San Mateo but address not confirmed.",
        "imageName": "surveymonkey.com.jpg",
        "id": "f921cd4f-332c-4184-9148-3d2be9f8096e",
        "lat": 37.5436426,
        "lng": -122.2928685,
        "wikipediaSlug": "SurveyMonkey",
        "isHeadquarters": true
    },
    {
        "name": "Zendesk",
        "address": "181 Fremont St. San Francisco, CA 94105",
        "description": "Provider of customer service and engagement software for businesses; HQ in San Francisco but address not confirmed.",
        "imageName": "zendesk.com.jpg",
        "id": "5dccc367-a5a-48ca-a2e5-d013bca77239",
        "lat": 37.7896113,
        "lng": -122.3954593,
        "wikipediaSlug": "Zendesk",
        "isHeadquarters": true
    },
    {
        "name": "Autodesk",
        "address": "One Market, Ste. 400, San Francisco, CA 94105",
        "description": "Global leader in 3D design, engineering, and entertainment software, best known for AutoCAD, Revit, and Maya.",
        "imageName": "autodesk.com.jpg",
        "id": "08835d9b-795b-4c81-b3fa-0e17281edff5",
        "lat": 37.7932577,
        "lng": -122.3944272,
        "wikipediaSlug": "Autodesk",
        "isHeadquarters": true
    },
    {
        "name": "Discord",
        "address": "444 De Haro Street, Suite 200, San Francisco, CA 94107",
        "description": "Voice, video, and text chat platform popular with gaming and online communities, used for group communication and collaboration.",
        "imageName": "discord.com.jpg",
        "id": "00f00765-e51a-43d8-a17b-93b6429383f1",
        "lat": 37.764616,
        "lng": -122.4018618,
        "wikipediaSlug": "Discord",
        "isHeadquarters": true
    },
    {
        "name": "Twilio",
        "address": "101 Spear Street, Fifth Floor, San Francisco, CA 94105",
        "description": "Cloud communications platform enabling businesses to integrate voice, SMS, and other messaging services into their applications via APIs.",
        "imageName": "twilio.com.jpg",
        "id": "4c575fda-775b-4ea5-987a-95948ba12def",
        "lat": 37.7920276,
        "lng": -122.3931103,
        "wikipediaSlug": "Twilio",
        "isHeadquarters": true
    },
    {
        "name": "Asana",
        "address": "633 Folsom St, Suite 100, San Francisco, CA 94107",
        "description": "Work management platform designed to help teams organize, track, and manage their projects and tasks.",
        "imageName": "asana.com.jpg",
        "id": "76403dd0-937e-43e2-a5ee-15400f1c0c2c",
        "lat": 37.7846034,
        "lng": -122.3973043,
        "wikipediaSlug": "Asana,_Inc.",
        "isHeadquarters": true
    },
    {
        "name": "Cloudflare",
        "address": "101 Townsend St, San Francisco, CA 94107",
        "description": "Web infrastructure and security company providing content delivery network (CDN), DDoS mitigation, and internet security services.",
        "imageName": "cloudflare.com.jpg",
        "id": "ebd67e5f-5754-4a1a-8d63-e3bd8eedb89b",
        "lat": 37.78022259999999,
        "lng": -122.3905874,
        "wikipediaSlug": "Cloudflare",
        "isHeadquarters": true
    },
    {
        "name": "Okta",
        "address": "100 First Street, Suite 600, San Francisco, CA 94105",
        "description": "Identity and access management company offering secure authentication and single sign-on solutions for enterprises.",
        "imageName": "okta.com.jpg",
        "id": "33ec23e7-6bdd-4f97-afaa-3226fff14575",
        "lat": 37.7894956,
        "lng": -122.397478,
        "wikipediaSlug": "Okta,_Inc.",
        "isHeadquarters": true
    },
    {
        "name": "Fastly",
        "address": "475 Brannan St, Suite 300, San Francisco, CA 94107",
        "description": "Edge cloud platform delivering content delivery, security, and edge computing services for websites and applications.",
        "imageName": "fastly.com.jpg",
        "id": "76a25817-4023-466f-b96c-7085385df6f6",
        "lat": 37.7786899,
        "lng": -122.3955703,
        "wikipediaSlug": "Fastly",
        "isHeadquarters": true
    },
    {
        "name": "PagerDuty",
        "address": "600 Townsend St, Suite 200, San Francisco, CA 94103",
        "description": "Incident response platform for IT departments, helping organizations manage and resolve critical incidents quickly.",
        "imageName": "pagerduty.com.jpg",
        "id": "ebdd3538-2345-440b-ba01-ba48c712821f",
        "lat": 37.771696,
        "lng": -122.4025698,
        "wikipediaSlug": "PagerDuty",
        "isHeadquarters": true
    },
    {
        "name": "Databricks",
        "address": "160 Spear Street, Suite 1300, San Francisco, CA 94105",
        "description": "Data and AI company known for its unified analytics platform built on Apache Spark, enabling big data processing and machine learning.",
        "imageName": "databricks.com.jpg",
        "id": "6461508e-86a4-45ec-b190-e73eb1ecc984",
        "lat": 37.79131599999999,
        "lng": -122.393725,
        "wikipediaSlug": "Databricks",
        "isHeadquarters": true
    },
    {
        "name": "Zoox",
        "address": "1149 Chess Dr, Foster City, CA 94404",
        "description": "Autonomous vehicle company developing self-driving cars and mobility solutions for urban environments.",
        "imageName": "zoox.com.jpg",
        "id": "ca1eae68-cd44-4576-b84f-a6fce151cf3f",
        "lat": 37.56771,
        "lng": -122.27274,
        "wikipediaSlug": "Zoox_(company)",
        "isHeadquarters": true
    },
    {
        "name": "Lime",
        "address": "85 2nd St, San Francisco, CA 94105",
        "description": "Micromobility company offering electric scooter and bike rentals for urban transportation.",
        "imageName": "li.me.jpg",
        "id": "6f62cee8-0fa3-49fe-bb29-40de83d6affb",
        "lat": 37.7883503,
        "lng": -122.3997377,
        "wikipediaSlug": "Lime_(transportation_company)",
        "isHeadquarters": true
    },
    {
        "name": "Cruise",
        "address": "333 Brannan St, San Francisco, CA 94107",
        "description": "Developer of autonomous vehicle technology focused on self-driving cars for ride-hailing services.",
        "imageName": "getcruise.com.jpg",
        "id": "ec345b02-af64-4579-b61a-eb413475649a",
        "lat": 37.7808673,
        "lng": -122.3925739,
        "wikipediaSlug": "Cruise_(autonomous_vehicle)",
        "isHeadquarters": true
    },
    {
        "name": "ChargePoint",
        "address": "240 East Hacienda Avenue, Campbell, CA 95008",
        "description": "Provider of electric vehicle charging infrastructure and networked charging solutions for businesses and drivers.",
        "imageName": "chargepoint.com.jpg",
        "id": "c823da3d-11c3-44ea-988a-de293643f8cb",
        "lat": 37.2666902,
        "lng": -121.9570536,
        "wikipediaSlug": "ChargePoint",
        "isHeadquarters": true
    },
    {
        "name": "NerdWallet",
        "address": "55 Hawthorne St, 10th Floor, San Francisco, CA 94105",
        "description": "Personal finance company offering tools and advice for credit cards, loans, investing, and financial decision-making.",
        "imageName": "nerdwallet.com.jpg",
        "id": "44e9e35b-0994-4c91-a8c2-86646ad61c94",
        "lat": 37.7855152,
        "lng": -122.3987364,
        "wikipediaSlug": "NerdWallet",
        "isHeadquarters": true
    },
    {
        "name": "Quora",
        "address": "650 Castro St, Suite 450, Mountain View, CA 94041",
        "description": "Question-and-answer platform where users share knowledge and expertise on a wide range of topics.",
        "imageName": "quora.com.jpg",
        "id": "179771d0-3f79-4daa-8709-fb6fc26e61c5",
        "lat": 37.3880555,
        "lng": -122.0822826,
        "wikipediaSlug": "Quora",
        "isHeadquarters": true
    },
    {
        "name": "Replit",
        "address": "767 Bryant St, San Francisco, CA 94107",
        "description": "Online coding platform enabling users to write, run, and collaborate on code in multiple programming languages.",
        "imageName": "replit.com.jpg",
        "id": "88807271-d295-482c-b4b7-eaa0269b08b1",
        "lat": 37.7763746,
        "lng": -122.4016047,
        "wikipediaSlug": "Replit",
        "isHeadquarters": true
    },
    {
        "name": "Wikimedia Foundation",
        "address": "1 Montgomery Street, Suite 1600, San Francisco, CA 94104",
        "description": "Nonprofit organization that operates Wikipedia and other free knowledge projects.",
        "imageName": "wikimedia.org.jpg",
        "id": "649d5175-7924-4780-a301-0bdc38677635",
        "lat": 37.7892447,
        "lng": -122.4022503,
        "wikipediaSlug": "Wikimedia_Foundation",
        "isHeadquarters": true
    },
    {
        "name": "Glassdoor",
        "address": "300 Mission St, 16th Floor, San Francisco, CA 94105",
        "description": "Online platform where jobseekers can search for jobs, research potential employers, and read anonymous company reviews and salary information. Founded in 2007, Glassdoor is known for its transparency and user-generated insights into workplace culture.",
        "imageName": "glassdoor.com.jpg",
        "id": "db2611f3-78fa-4500-be70-37eba62b13d7",
        "lat": 37.7913266,
        "lng": -122.3963941,
        "wikipediaSlug": "Glassdoor",
        "isHeadquarters": true
    },
    {
        "name": "Chegg",
        "address": "3990 Freedom Circle, Santa Clara, CA 95054-1204",
        "description": "Education technology company providing homework help, textbook rentals, online tutoring, and other student services.",
        "imageName": "chegg.com.jpg",
        "id": "00cfd19a-6b67-4633-b052-de949ca39745",
        "lat": 37.3885666,
        "lng": -121.972258,
        "wikipediaSlug": "Chegg",
        "isHeadquarters": true
    },
    {
        "name": "Udemy",
        "address": "600 Harrison Street, 3rd Floor, San Francisco, CA 94107",
        "description": "Online learning and teaching platform offering a vast range of courses in business, technology, personal development, and more.",
        "imageName": "udemy.com.jpg",
        "id": "54fd1fa0-13d2-4564-946d-c706c9c87cd8",
        "lat": 37.7841915,
        "lng": -122.3958981,
        "wikipediaSlug": "Udemy",
        "isHeadquarters": true
    },
    {
        "name": "Poshmark",
        "address": "203 Redwood Shores Parkway, 8th Floor, Redwood City, CA 94065",
        "description": "Social commerce marketplace for buying and selling new and second-hand fashion, home goods, and electronics.",
        "imageName": "poshmark.com.jpg",
        "id": "dfc85c25-17e2-4fcb-b537-3d90c4fcf028",
        "lat": 37.5211409,
        "lng": -122.2545364,
        "wikipediaSlug": "Poshmark",
        "isHeadquarters": true
    },
    {
        "name": "Stitch Fix",
        "address": "One Montgomery Tower, Suite 1500, San Francisco, CA 94104",
        "description": "Online personal styling service using expert stylists and AI to recommend clothing and accessories tailored to individual tastes.",
        "imageName": "stitchfix.com.jpg",
        "id": "afb32da1-c05d-4d9e-84e8-36acfa65929b",
        "lat": 37.7892748,
        "lng": -122.4035729,
        "wikipediaSlug": "Stitch_Fix",
        "isHeadquarters": true
    },
    {
        "name": "Eventbrite",
        "address": "95 Third Street, 2nd Floor, San Francisco, CA 94103",
        "description": "Online event management and ticketing platform enabling users to browse, create, and promote local events.",
        "imageName": "eventbrite.com.jpg",
        "id": "24719c1e-74ab-4498-9ba3-da2025142c26",
        "lat": 37.7866019,
        "lng": -122.4021831,
        "wikipediaSlug": "Eventbrite",
        "isHeadquarters": true
    },
    {
        "name": "ServiceNow",
        "address": "2225 Lawson Lane, Santa Clara, CA 95054",
        "description": "Cloud-based platform for automating enterprise workflows, specializing in IT service management and business process automation.",
        "imageName": "servicenow.com.jpg",
        "id": "50f9bb21-b3a6-4036-b92c-1118396d6464",
        "lat": 37.3758349,
        "lng": -121.9627351,
        "wikipediaSlug": "ServiceNow",
        "isHeadquarters": true
    },
    {
        "name": "VMware",
        "address": "3401 Hillview Avenue, Palo Alto, CA 94304",
        "description": "Virtualization and cloud computing company known for its hypervisor and software solutions for data centers and enterprise IT.",
        "imageName": "vmware.com.jpg",
        "id": "a7879f17-1576-4b2e-ac16-6669c59828ba",
        "lat": 37.401373,
        "lng": -122.1438228,
        "wikipediaSlug": "VMware",
        "isHeadquarters": true
    },
    {
        "name": "Mozilla",
        "address": "149 New Montgomery Street, 4th Floor, San Francisco, CA 94105",
        "description": "Nonprofit organization and software community best known for the Firefox browser and for promoting open standards and free software.",
        "imageName": "mozilla.org.jpg",
        "id": "af42c6d2-747c-4119-b280-2dd94e0b1e2d",
        "lat": 37.7869417,
        "lng": -122.3996013,
        "wikipediaSlug": "Mozilla",
        "isHeadquarters": true
    },
    {
        "name": "McAfee",
        "address": "6220 America Center Drive, America Center Building 4, San Jose, CA 95002",
        "description": "Global cybersecurity company providing antivirus, endpoint security, and online protection solutions for consumers and businesses.",
        "imageName": "mcafee.com.jpg",
        "id": "653150be-9386-4fd1-8c85-67c867475e78",
        "lat": 37.4185772,
        "lng": -121.9782146,
        "wikipediaSlug": "McAfee",
        "isHeadquarters": true
    },
    {
        "name": "Malwarebytes",
        "address": "3979 Freedom Circle, 12th Floor, Santa Clara, CA 95054",
        "description": "Cybersecurity company specializing in malware detection, removal, and protection software for individuals and organizations.",
        "imageName": "malwarebytes.com.jpg",
        "id": "f878e004-6342-4c75-999d-e2fae040c922",
        "lat": 37.3880338,
        "lng": -121.9740691,
        "wikipediaSlug": "Malwarebytes",
        "isHeadquarters": true
    },
    {
        "name": "Shutterfly",
        "address": "10 Almaden Boulevard, San Jose, CA 95113",
        "description": "Online photo service offering photo books, personalized gifts, prints, and other custom photo products.",
        "imageName": "shutterfly.com.jpg",
        "id": "85ab6a7c-5a7b-424d-af2c-92928c52a4db",
        "lat": 37.3337307,
        "lng": -121.8937927,
        "wikipediaSlug": "Shutterfly",
        "isHeadquarters": true
    },
    {
        "name": "Zazzle",
        "address": "1800 Seaport Blvd, Redwood City, CA 94063",
        "description": "Online marketplace for custom products, allowing designers and makers to sell personalized goods to consumers worldwide.",
        "imageName": "zazzle.com.jpg",
        "id": "fc1f4127-12ca-4ed3-8bd8-a60673260090",
        "lat": 37.5108541,
        "lng": -122.2014758,
        "wikipediaSlug": "Zazzle",
        "isHeadquarters": true
    },
    {
        "name": "Brave",
        "address": "512 2nd St, San Francisco, CA 94107",
        "description": "Privacy-focused software company best known for the Brave browser, which blocks ads and trackers by default.",
        "imageName": "brave.com.jpg",
        "id": "b5429dd4-52c7-49f4-a99e-cf02045131b3",
        "lat": 37.7827092,
        "lng": -122.3935642,
        "wikipediaSlug": "Brave_(web_browser)",
        "isHeadquarters": true
    },
    {
        "name": "Scribd",
        "address": "460 Bryant St #100, San Francisco, CA 94107",
        "description": "Digital library and subscription service offering ebooks, audiobooks, magazines, and documents to readers worldwide.",
        "imageName": "scribd.com.jpg",
        "id": "5c1e6277-e43f-42c7-9361-cdfd4a70a59e",
        "lat": 37.78213830000001,
        "lng": -122.3952717,
        "wikipediaSlug": "Scribd",
        "isHeadquarters": true
    },
    {
        "name": "Medium",
        "address": "799 Market St, 5th Floor, San Francisco, CA 94103",
        "description": "Online publishing platform for articles and blogs, connecting writers and readers through a subscription-based model.",
        "imageName": "medium.com.jpg",
        "id": "2a7fd46e-3a08-4aee-94aa-0cc85e405f7e",
        "lat": 37.7858846,
        "lng": -122.4052894,
        "wikipediaSlug": "Medium_(website)",
        "isHeadquarters": true
    },
    {
        "name": "Postman",
        "address": "201 Mission Street Suite 2375 San Francisco, CA 94105",
        "id": "36e31b83-0737-4fb8-8404-6e512c2c8c05",
        "lat": 37.7910299,
        "lng": -122.3948311,
        "imageName": "postman.com.jpg",
        "description": "Postman is an API platform for building and using APIs. It simplifies each step of the API lifecycle and streamlines collaboration to help developers create better APIs faster. Founded in 2012 by Abhinav Asthana, the company moved its headquarters from Bangalore to San Francisco in 2017 and serves over 30 million registered users and 500,000 organizations worldwide.",
        "wikipediaSlug": "Postman_(software)",
        "isHeadquarters": true
    },
    {
        "name": "Applied Materials",
        "address": "3050 Bowers Avenue PO Box 58039 Santa Clara, CA 95054-3299",
        "id": "cebcebd9-7b30-4d6f-81b4-e55a3375a77a",
        "lat": 37.3777843,
        "lng": -121.9792715,
        "imageName": "appliedmaterials.com.jpg",
        "description": "Applied Materials, Inc. is an American corporation that supplies equipment, services and software for the manufacture of semiconductor chips, flat panel displays, and solar products. Founded in 1967, the company is headquartered in Santa Clara, California, and is the second largest supplier of semiconductor equipment in the world based on revenue.",
        "wikipediaSlug": "Applied_Materials",
        "isHeadquarters": true
    },
    {
        "name": "Cloudera",
        "address": "5470 Great America Parkway Santa Clara, CA 95054",
        "id": "2fa93d7d-b9e6-4ea3-a97c-9c333baae2fc",
        "lat": 37.4131466,
        "lng": -121.9782564,
        "imageName": "cloudera.com.jpg",
        "description": "Cloudera, Inc. is an American data lake software company that provides a hybrid data platform for managing and analyzing data. Founded in 2008 by former engineers from Google, Yahoo!, and Facebook, the company offers cloud-native data services and helps enterprises transform with big data and machine learning solutions across various industries.",
        "wikipediaSlug": "Cloudera",
        "isHeadquarters": true
    },
    {
        "name": "Visa",
        "address": "One Market Plaza San Francisco, CA 94105",
        "id": "950faf8d-fc90-4a26-9bcb-701f00b472c2",
        "lat": 37.7937188,
        "lng": -122.3942152,
        "imageName": "visa.com.jpg",
        "description": "Visa's San Francisco Innovation Center is a state-of-the-art facility designed for clients, partners, and governments to collaborate on the future of digital commerce. The center provides immersive experiences and showcases Visa's innovations in payments technology, security, and next-generation commerce solutions.",
        "wikipediaSlug": "Visa_Inc.",
        "isHeadquarters": false
    },
    {
        "name": "Scale AI",
        "address": "650 Townsend Street San Francisco, CA 94103 United States",
        "id": "a02d96e2-46df-48cb-bbff-723ac488f22e",
        "lat": 37.7709753,
        "lng": -122.4036404,
        "imageName": "scaleai.com.jpg",
        "description": "Scale AI, Inc. is an American data annotation company that provides data labeling and model evaluation services for artificial intelligence applications. Founded in 2016 by Alexandr Wang, the company serves commercial clients including OpenAI, Meta, and government agencies, specializing in training data for autonomous vehicles, computer vision, and large language models.",
        "wikipediaSlug": "Scale_AI",
        "isHeadquarters": true
    },
    {
        "name": "Proofpoint",
        "address": "925 West Maude Avenue Sunnyvale, CA 94085 United States",
        "id": "5514c581-9e5f-4303-ba29-f5ad5bce6548",
        "lat": 37.3929159,
        "lng": -122.0396171,
        "imageName": "proofpoint.com.jpg",
        "description": "Proofpoint, Inc. is an American enterprise cybersecurity company that provides software as a service and products for email security, identity threat defense, data loss prevention, and email archiving. Founded in 2002 by Eric Hahn, former CTO of Netscape, the company was acquired by private equity firm Thoma Bravo for $12.3 billion in 2021.",
        "wikipediaSlug": "Proofpoint,_Inc.",
        "isHeadquarters": true
    },
    {
        "name": "Physical Intelligence",
        "address": "396 Treat Avenue San Francisco, CA 94110 United States",
        "id": "ca69c063-946a-4e08-bce5-e586f2599c1d",
        "lat": 37.7640188,
        "lng": -122.4138198,
        "imageName": "physicalintelligence.com.jpg",
        "description": "Physical Intelligence works on the integration of general-purpose artificial intelligence into the physical world, with a focus on robotics. Founded in 2024, the company develops foundation models and learning algorithms that allow robots and physically-actuated devices to perform complex tasks, backed by investors including Jeff Bezos, OpenAI, and Sequoia Capital.",
        "wikipediaSlug": "Physical_Intelligence",
        "isHeadquarters": true
    },
    {
        "name": "PostHog",
        "address": "2261 Market Street Suite 4008 San Francisco, CA 94114",
        "id": "5c883bd0-727d-4e29-babf-f4fc4e49270b",
        "lat": 37.7647616,
        "lng": -122.4320143,
        "imageName": "posthog.com.jpg",
        "description": "PostHog provides a platform for product development and analytics within the software industry. Founded in 2020, it offers product analytics, session replay, feature flags, error tracking, and tools for conducting experiments and surveys. The company serves developers and product teams with open-source and cloud-based solutions for understanding user behavior.",
        "wikipediaSlug": "PostHog",
        "isHeadquarters": true
    },
    {
        "name": "Perplexity",
        "address": "115 Sansome Street Suite 900 San Francisco, CA 94104",
        "id": "89b30008-9fc3-415d-85be-42c4bb3b3769",
        "lat": 37.7916591,
        "lng": -122.4012644,
        "imageName": "perplexity.com.jpg",
        "description": "Perplexity develops artificial intelligence-powered information discovery tools designed for answering questions and exploring topics. Founded in 2022, the company's tools provide real-time answers, personalized search experiences, and integration with various data sources, serving as an AI-powered answer engine that searches the internet in real-time.",
        "wikipediaSlug": "Perplexity",
        "isHeadquarters": true
    },
    {
        "name": "Neon",
        "address": "2128 Sand Hill Road Menlo Park, CA 94025",
        "id": "29aa7d36-78ac-4df6-b05b-94056871bf86",
        "lat": 37.4256493,
        "lng": -122.1934507,
        "imageName": "neon.com.jpg",
        "description": "Neon is a multi-cloud serverless Postgres provider that separates storage from computing, allowing for stateless and serverless PostgreSQL. Founded in 2021 by database experts, the company offers a cloud-native database solution with instant branching, autoscaling, and developer-friendly features for modern applications.",
        "wikipediaSlug": "Neon_(database)",
        "isHeadquarters": false
    },
    {
        "name": "Vercel",
        "address": "1900 Jefferson Street San Francisco, CA 94123 United States",
        "id": "896ed5e1-2201-4ace-b62b-7d68db3d76bf",
        "lat": 37.8047979,
        "lng": -122.4441365,
        "imageName": "vercel.com.jpg",
        "description": "Vercel provides the developer experience and infrastructure to build, scale, and secure a faster, more personalized web. Founded in 2015 by Guillermo Rauch, the company is the creator and maintainer of Next.js and offers a frontend cloud platform. While headquartered in San Francisco, this address is a registered mailing location rather than Vercel's primary campus.",
        "wikipediaSlug": "Vercel",
        "isHeadquarters": false
    },
    {
        "name": "Grammarly",
        "address": "548 Market Street Suite 35410 San Francisco, CA 94104",
        "id": "dc5b967c-944c-4305-8ff8-8d02607572f9",
        "lat": 37.7908517,
        "lng": -122.4006138,
        "imageName": "grammarly.com.jpg",
        "description": "Grammarly Inc. provides AI-powered writing assistance through its grammar checking, spell checking, and plagiarism detection software. Founded in 2009, the company offers browser extensions, desktop applications, and mobile apps that help users improve their writing across various platforms and use cases, serving millions of users worldwide.",
        "wikipediaSlug": "Grammarly",
        "isHeadquarters": true
    },
    {
        "name": "Strava",
        "address": "208 Utah Street San Francisco, CA 94103",
        "id": "bb5bcd75-e01e-4740-ada4-6c945f095217",
        "lat": 37.7669057,
        "lng": -122.4068881,
        "imageName": "strava.com.jpg",
        "description": "Strava is a social fitness platform that allows users to track their athletic activities and share them with a community of athletes. Founded in 2009, the app connects millions of runners, cyclists, and other athletes worldwide through GPS tracking, route sharing, and social features that gamify fitness and outdoor activities.",
        "wikipediaSlug": "Strava",
        "isHeadquarters": true
    },
    {
        "name": "Concentrix",
        "address": "39899 Balentine Drive Suite 235 Newark, CA 94560",
        "id": "c1ca53ba-0e7e-4615-a8b8-a5fecfe7e732",
        "lat": 37.5214359,
        "lng": -121.9939188,
        "imageName": "concentrix.com.jpg",
        "description": "Concentrix Corporation is an American business process outsourcing company that provides customer experience solutions and technology services. Founded in 1983 and spun off from SYNNEX in 2020, the company serves Fortune Global 500 clients with contact center services, digital solutions, and business transformation services across multiple industries.",
        "wikipediaSlug": "Concentrix",
        "isHeadquarters": true
    },
    {
        "name": "Keysight Technologies",
        "address": "1400 Fountaingrove Parkway Santa Rosa, CA 95403-1738",
        "id": "10ad3ea0-63eb-41f8-aad7-6d4b5470f326",
        "lat": 38.4801318,
        "lng": -122.7106152,
        "imageName": "keysighttechnologies.com.jpg",
        "description": "Keysight Technologies, Inc. is a global leader in electronic design and test solutions. Spun off from Agilent Technologies in 2014, the company manufactures electronic test and measurement equipment for telecommunications, aerospace and defense, industrial, computer and semiconductor industries. It's the largest company ever headquartered in Sonoma County.",
        "wikipediaSlug": "Keysight_Technologies",
        "isHeadquarters": true
    },
    {
        "name": "Broadcom",
        "address": "3421 Hillview Avenue Palo Alto, CA 94304 United States",
        "id": "5141bcdb-d3cf-44fc-998f-193554b06e5c",
        "lat": 37.3990248,
        "lng": -122.1444044,
        "imageName": "broadcom.com.jpg",
        "description": "Broadcom Inc. is an American multinational designer, developer, manufacturer, and global supplier of semiconductor and infrastructure software products. The company serves data center, networking, broadband, wireless, storage, and industrial markets. Originally formed through the merger of Avago Technologies and Broadcom Corporation in 2016.",
        "wikipediaSlug": "Broadcom",
        "isHeadquarters": true
    },
    {
        "name": "Cadence Design Systems",
        "address": "2655 Seely Avenue Building 5 San Jose, CA 95134",
        "id": "49b5e48c-c0f1-404b-96c4-6d9a0366e96e",
        "lat": 37.3962631,
        "lng": -121.9195417,
        "imageName": "cadencedesignsystems.com.jpg",
        "description": "Cadence Design Systems, Inc. is an American multinational technology company that provides electronic design automation (EDA) software, hardware, and IP for designing integrated circuits, systems on chips, printed circuit boards, and increasingly, pharmaceutical drugs. Founded in 1988 through a merger, the company serves the electronics, aerospace, defense and automotive industries.",
        "wikipediaSlug": "Cadence_Design_Systems",
        "isHeadquarters": true
    },
    {
        "name": "TD Synnex",
        "address": "44201 Nobel Drive Fremont, CA 94538",
        "id": "ef55631f-1886-42eb-8718-898518dd5a8d",
        "lat": 37.496726,
        "lng": -121.9798511,
        "imageName": "tdsynnex.com.jpg",
        "description": "TD SYNNEX is a Fortune 500 global distributor and solutions aggregator for the IT ecosystem. The company connects technology vendors with resellers and provides distribution, logistics, and technology solutions services. Formed through the merger of SYNNEX and Tech Data in 2021, it serves customers across more than 100 countries.",
        "wikipediaSlug": "TD_SYNNEX",
        "isHeadquarters": true
    },
    {
        "name": "Global Logic",
        "address": "2535 Augustine Drive Suite 500 Santa Clara, CA 95054",
        "id": "3da13669-b775-4e84-9692-140f2db49b19",
        "lat": 37.38327220000001,
        "lng": -121.9714814,
        "imageName": "globallogic.com.jpg",
        "description": "GlobalLogic is a digital product engineering company that integrates experience design and complex engineering to help clients accelerate their digital transformation. The company provides end-to-end product development services including design, development, and testing across various industries including automotive, communications, and healthcare.",
        "wikipediaSlug": "GlobalLogic",
        "isHeadquarters": true
    },
    {
        "name": "Sanmina",
        "address": "2700 North First Street San Jose, CA 95134",
        "id": "7c217e99-d290-428b-98c9-18513c1c5107",
        "lat": 37.3900922,
        "lng": -121.9296196,
        "imageName": "sanmina.com.jpg",
        "description": "Sanmina Corporation is an American electronics manufacturing services (EMS) provider that serves original equipment manufacturers in communications and computer hardware fields. Founded in 1980, the company operates nearly 80 manufacturing sites worldwide and is one of the world's largest independent manufacturers of printed circuit boards and backplanes.",
        "wikipediaSlug": "Sanmina_Corporation",
        "isHeadquarters": true
    },
    {
        "name": "Workday",
        "address": "6110 Stoneridge Mall Road Pleasanton, CA 94588",
        "id": "817f86f0-7c1f-425f-a06e-082edc431bfa",
        "lat": 37.6987306,
        "lng": -121.9268254,
        "imageName": "workday.com.jpg",
        "description": "Workday, Inc. is an American on-demand financial management and human capital management software vendor. Founded in 2005 by Dave Duffield and Aneel Bhusri, the company provides cloud-based enterprise software applications for finance and human resources, serving organizations worldwide with subscription-based business model.",
        "wikipediaSlug": "Workday,_Inc.",
        "isHeadquarters": true
    },
    {
        "name": "Palo Alto Networks",
        "address": "3000 Tannery Way Santa Clara, CA 95054",
        "id": "595dd181-15e2-4678-af25-647fdd4e40d8",
        "lat": 37.3830204,
        "lng": -121.9837566,
        "imageName": "paloaltonetworks.com.jpg",
        "description": "Palo Alto Networks is an American multinational cybersecurity company that provides firewalls, cloud security, and endpoint protection. Founded in 2005, the company pioneered next-generation firewalls and offers a comprehensive cybersecurity platform. The company operates from a state-of-the-art campus in Santa Clara spanning nearly one million square feet.",
        "wikipediaSlug": "Palo_Alto_Networks",
        "isHeadquarters": true
    },
    {
        "name": "SeatGeek",
        "address": "902 Broadway, New York, NY 10010",
        "description": "Mobile-focused ticket platform that enables users to buy and sell tickets for live sports, concerts, and theater events.",
        "imageName": "seatgeek.com.jpg",
        "id": "1ff6e548-8ad0-47d5-ba62-ebe7ead2199d",
        "lat": 40.7394362,
        "lng": -73.9895524,
        "wikipediaSlug": "SeatGeek",
        "isHeadquarters": true
    },
    {
        "name": "MongoDB",
        "address": "1633 Broadway, 38th Floor, New York, NY 10019",
        "description": "Developer of a leading general-purpose, document-based database platform, offering cloud and on-premises solutions for scalable data management.",
        "imageName": "mongodb.com.jpg",
        "id": "d7a84784-f723-4a59-ac3c-ddfa3793864b",
        "lat": 40.7620791,
        "lng": -73.98460990000001,
        "wikipediaSlug": "MongoDB",
        "isHeadquarters": true
    },
    {
        "name": "Etsy",
        "address": "117 Adams Street, Brooklyn, NY 11201",
        "description": "Global online marketplace specializing in unique, handmade, vintage, and creative goods from independent sellers.",
        "imageName": "etsy.com.jpg",
        "id": "6dba7613-eec3-41b9-8abe-e25543944c70",
        "lat": 40.7005529,
        "lng": -73.98828879999999,
        "wikipediaSlug": "Etsy",
        "isHeadquarters": true
    },
    {
        "name": "Codecademy",
        "address": "600 Broadway, 2nd Floor New York, NY 10012",
        "description": "Online interactive learning platform offering coding classes in various programming languages for beginners and professionals.",
        "imageName": "codecademy.com.jpg",
        "id": "9249a77c-3f0c-4c34-9257-fa2f9189d269",
        "lat": 40.7246343,
        "lng": -73.9976263,
        "wikipediaSlug": "Codecademy",
        "isHeadquarters": true
    },
    {
        "name": "Kickstarter",
        "address": "58 Kent St, Brooklyn, NY 11222",
        "description": "Crowdfunding platform enabling creators to raise funds for creative projects in art, music, technology, and more.",
        "imageName": "kickstarter.com.jpg",
        "id": "1f4dfed6-219d-4d34-a48b-9ec9d29d88b0",
        "lat": 40.7303597,
        "lng": -73.9586928,
        "wikipediaSlug": "Kickstarter",
        "isHeadquarters": false
    },
    {
        "name": "Peloton",
        "address": "441 9th Avenue, 6th Floor, New York, NY 10001",
        "description": "Fitness technology company offering connected exercise equipment and subscription-based interactive workout classes.",
        "imageName": "onepeloton.com.jpg",
        "id": "f6d45a55-2ae8-4ef0-a9cb-b6a531c25166",
        "lat": 40.7539512,
        "lng": -73.9965153,
        "wikipediaSlug": "Peloton_Interactive",
        "isHeadquarters": true
    },
    {
        "name": "Squarespace",
        "address": "225 Varick Street, 12th Floor, New York, NY 10014",
        "description": "All-in-one website building and hosting platform providing tools for creating professional websites, online stores, and portfolios.",
        "imageName": "squarespace.com.jpg",
        "id": "2f9a29b9-c0c6-4e83-a256-887ba79ce79c",
        "lat": 40.7289729,
        "lng": -74.00549389999999,
        "wikipediaSlug": "Squarespace",
        "isHeadquarters": true
    },
    {
        "name": "Zocdoc",
        "address": "568 Broadway, 2nd Floor, New York, NY 10012",
        "description": "Online healthcare marketplace allowing patients to find doctors, book appointments, and access telehealth services.",
        "imageName": "zocdoc.com.jpg",
        "id": "9b8cc6fb-168b-49c8-a53a-d5647ab1e07d",
        "lat": 40.7243328,
        "lng": -73.997408,
        "wikipediaSlug": "Zocdoc",
        "isHeadquarters": true
    },
    {
        "name": "Vimeo",
        "address": "330 West 34th Street, 5th Floor, New York, NY 10001",
        "description": "Video software company offering cloud-based video hosting, creation, collaboration, and analytics tools for businesses and creators.",
        "imageName": "vimeo.com.jpg",
        "id": "6b3173cc-48bf-4bc9-885f-65c0f05e28d5",
        "lat": 40.75260189999999,
        "lng": -73.9951169,
        "wikipediaSlug": "Vimeo",
        "isHeadquarters": true
    },
    {
        "name": "Datadog",
        "address": "620 8th Avenue, 45th Floor, New York, NY 10018",
        "description": "Cloud-based monitoring and analytics platform for IT infrastructure, applications, and security in real-time.",
        "imageName": "datadoghq.com.jpg",
        "id": "fb297a6e-12a5-4ce6-a839-f5f6b1d8c20b",
        "lat": 40.7563103,
        "lng": -73.99029759999999,
        "wikipediaSlug": "Datadog",
        "isHeadquarters": true
    },
    {
        "name": "Shutterstock",
        "address": "350 Fifth Avenue, 20th Floor, New York, NY 10118",
        "description": "Global provider of licensed stock photography, footage, music, and editing tools for creative professionals and businesses.",
        "imageName": "shutterstock.com.jpg",
        "id": "8f29bba9-0897-4013-b8cc-07e30f8bcae2",
        "lat": 40.7484914,
        "lng": -73.9856709,
        "wikipediaSlug": "Shutterstock",
        "isHeadquarters": true
    },
    {
        "name": "Stash",
        "address": "257 Park Avenue South, Room 900, New York, NY 10010",
        "description": "Personal finance app offering investing, banking, and educational tools to help individuals save and build wealth.",
        "imageName": "stash.com.jpg",
        "id": "18419882-ef50-4c5a-8ce9-98b8ab0d0e58",
        "lat": 40.7385476,
        "lng": -73.9871936,
        "wikipediaSlug": "Stash_(company)",
        "isHeadquarters": true
    },
    {
        "name": "Hugging Face",
        "address": "20 Jay Street Suite 620, Brooklyn, NY 11201",
        "id": "47692b99-d1b0-4455-b8e0-61ee321c7a6d",
        "lat": 40.7040297,
        "lng": -73.9867893,
        "imageName": "huggingface.co.jpg",
        "isHeadquarters": true,
        "description": "Hugging Face is an AI-focused company that provides the world's leading platform for machine learning models, datasets, and applications. Founded in 2016, it operates as the 'GitHub of machine learning,' hosting over 500,000 models and serving millions of developers worldwide. The company democratizes AI by making state-of-the-art machine learning models accessible through its transformers library and Hub platform, supporting natural language processing, computer vision, and audio tasks. Hugging Face has raised over $395 million in funding and is valued at $4.5 billion, with backing from major tech companies including Google, Amazon, Nvidia, and Salesforce.",
        "wikipediaSlug": "Hugging_Face"
    },
    {
        "name": "DigitalOcean",
        "address": "101 Avenue of the Americas, 2nd Floor, New York, NY 10013",
        "id": "57edeb6e-05a7-4ae4-b1ab-b47eba6bbae3",
        "lat": 40.723405,
        "lng": -74.0052457,
        "imageName": "digitalocean.com.jpg",
        "isHeadquarters": true,
        "description": "DigitalOcean is a cloud infrastructure provider that simplifies web hosting and cloud computing for developers, startups, and small-to-medium businesses. Founded in 2011, the company offers virtual private servers called 'Droplets,' managed databases, Kubernetes services, and object storage solutions. Known for its developer-friendly approach, transparent pricing, and extensive documentation, DigitalOcean serves over 600,000 customers globally. The company went public in 2021 and operates 15 data centers worldwide, focusing on providing simple, scalable, and affordable cloud infrastructure that enables developers to build, deploy, and scale applications quickly.",
        "wikipediaSlug": "DigitalOcean"
    },
    {
        "name": "Amazon",
        "address": "440 Terry Ave N, Seattle, WA 98109",
        "id": "1fd06fe8-95a3-46ea-9a18-9dc79fa2c547",
        "imageName": "amazon.com.jpg",
        "description": "Amazon is a multinational technology company focused on e-commerce, cloud computing, digital streaming, and artificial intelligence. Founded in 1994 by Jeff Bezos, it started as an online bookstore and evolved into one of the world's largest retailers and cloud service providers. Amazon Web Services (AWS) is a leading cloud computing platform, while Prime membership offers shipping benefits and digital content. The company also operates devices like Alexa and ventures into logistics, advertising, and entertainment.",
        "wikipediaSlug": "Amazon_(company)",
        "isHeadquarters": true,
        "lat": 47.6227734,
        "lng": -122.3362322
    },
    {
        "name": "Microsoft",
        "address": "One Microsoft Way, Redmond, WA 98052",
        "id": "74ae1d6a-bceb-4a11-ab7f-4ea502fa8e43",
        "imageName": "microsoft.com.jpg",
        "description": "Microsoft is a multinational technology corporation that develops, manufactures, licenses, supports, and sells computer software, consumer electronics, and personal computers. Founded in 1975 by Bill Gates and Paul Allen, Microsoft is best known for Windows operating systems, Office productivity suite, Azure cloud platform, and Xbox gaming console. The company has transformed from a software-focused business to a cloud-first, mobile-first organization under CEO Satya Nadella.",
        "wikipediaSlug": "Microsoft",
        "isHeadquarters": true,
        "lat": 47.6435509,
        "lng": -122.1305991
    },
    {
        "name": "Expedia",
        "address": "1111 Expedia Group Way W, Seattle, WA 98119",
        "id": "b0aa78d2-a71a-4ce9-9b76-1fdbc577d1b9",
        "imageName": "expedia.com.jpg",
        "description": "Expedia Group is an online travel company that operates as a platform for booking flights, hotels, car rentals, and vacation packages. Founded in 1996 as a division of Microsoft, it became independent in 1999. The company owns multiple brands including Expedia.com, Hotels.com, Vrbo, and Trivago. Expedia revolutionized travel booking by providing consumers with direct access to compare prices and make reservations online, becoming one of the world's largest online travel agencies.",
        "wikipediaSlug": "Expedia_Group",
        "isHeadquarters": true,
        "lat": 47.6288158,
        "lng": -122.3751915
    },
    {
        "name": "T-Mobile",
        "address": "12920 SE 38th St, Bellevue, WA 98006",
        "id": "33bc6816-05f6-4ee4-89e2-8954cad60ab1",
        "imageName": "t-mobile.com.jpg",
        "description": "T-Mobile US is a major wireless network operator providing mobile communications services. Originally founded as VoiceStream Wireless in 1994, it was acquired by Deutsche Telekom and rebranded as T-Mobile in 2002. Known for its 'Un-carrier' strategy, T-Mobile has disrupted the wireless industry by eliminating service contracts, offering unlimited data plans, and promoting customer-friendly policies. The company completed a merger with Sprint in 2020, making it the second-largest wireless carrier in the United States.",
        "wikipediaSlug": "T-Mobile_US",
        "isHeadquarters": true,
        "lat": 47.5765114,
        "lng": -122.1677093
    },
    {
        "name": "Zillow",
        "address": "1301 2nd Ave, Floor 31, Seattle, WA 98101",
        "id": "318d3c60-b5ef-4a82-b0bd-a98cdf4ddbae",
        "imageName": "zillow.com.jpg",
        "description": "Zillow is an online marketplace and technology company that facilitates real estate transactions. Founded in 2006, Zillow operates web-based platforms where users can search property listings, view neighborhood information, and estimate home values through its Zestimate tool. The company expanded beyond listings to offer services like iBuying (Zillow Offers), mortgage lending (Zillow Home Loans), and rental services (Zillow Rental Manager). Zillow has transformed how Americans buy, sell, and rent homes by digitizing the real estate experience.",
        "wikipediaSlug": "Zillow",
        "isHeadquarters": true,
        "lat": 47.6075897,
        "lng": -122.3382448
    },
    {
        "name": "Redfin",
        "address": "1099 Stewart St #600, Seattle, WA 98101",
        "id": "c230dfe4-a7b3-48b3-8eaf-223320855dac",
        "imageName": "redfin.com.jpg",
        "description": "Redfin is a technology-powered real estate brokerage that aims to redefine the home buying and selling experience. Founded in 2004, Redfin combines online property search tools with full-service real estate agents who are company employees rather than independent contractors. The company offers lower commission fees than traditional brokerages and provides services including home tours, market analysis, and closing support. Redfin also operates RedfinNow (iBuying) and mortgage services, leveraging technology to streamline real estate transactions.",
        "wikipediaSlug": "Redfin",
        "isHeadquarters": true,
        "lat": 47.6166294,
        "lng": -122.3325942
    },
    {
        "name": "Tableau Software",
        "address": "1621 N 34th St, Seattle, WA 98103",
        "id": "3d6c9a13-0b75-4994-be57-1020ff51d278",
        "imageName": "tableau.com.jpg",
        "description": "Tableau Software is a data visualization and business intelligence company that helps people see and understand data. Founded in 2003, Tableau developed intuitive drag-and-drop software that allows users to create interactive data visualizations and dashboards without programming knowledge. The platform connects to various data sources and enables organizations to make data-driven decisions through visual analytics. Salesforce acquired Tableau in 2019 for $15.7 billion, integrating it into their customer success platform.",
        "wikipediaSlug": "Tableau_Software",
        "isHeadquarters": true,
        "lat": 47.6478459,
        "lng": -122.3381771
    },
    {
        "name": "F5",
        "address": "801 5th Ave, Seattle, WA 98104",
        "id": "f8881042-e24b-4b3f-8ccc-8c6e914d2a01",
        "imageName": "f5.com.jpg",
        "description": "F5 Networks is a technology company that specializes in application delivery networking, security, and performance solutions. Founded in 1996, F5 develops hardware and software products that optimize application performance and security across various environments including on-premises, cloud, and hybrid infrastructures. Their flagship product is the BIG-IP application delivery controller, which provides load balancing, security, and traffic management. F5 has evolved to offer comprehensive application services and multi-cloud solutions for modern digital businesses.",
        "wikipediaSlug": "F5,_Inc.",
        "isHeadquarters": true,
        "lat": 47.6051193,
        "lng": -122.3310814
    },
    {
        "name": "Cray Inc.",
        "address": "901 5th Ave #1000, Seattle, WA 98164",
        "id": "6639c093-b2cc-4f20-8077-342571b39817",
        "imageName": "cray.com.jpg",
        "description": "Cray Inc. was a supercomputer manufacturer and pioneer in high-performance computing (HPC). Founded in 1972 by Seymour Cray, the company developed some of the world's fastest supercomputers used for scientific research, weather modeling, and complex simulations. Cray's systems were known for their innovative parallel processing architectures and vector processing capabilities. The company went through several ownership changes before being acquired by Hewlett Packard Enterprise (HPE) in 2019 for $1.3 billion, continuing its legacy in exascale computing.",
        "wikipediaSlug": "Cray",
        "isHeadquarters": true,
        "lat": 47.605816,
        "lng": -122.3319745
    },
    {
        "name": "Smartsheet",
        "address": "500 108th Ave NE #200, Bellevue, WA 98004",
        "id": "ba8b4182-0f9a-4b98-a8b2-cd52b776953f",
        "imageName": "smartsheet.com.jpg",
        "description": "Smartsheet is a cloud-based platform for work management and automation. Founded in 2005, Smartsheet provides a familiar spreadsheet-like interface combined with powerful project management, collaboration, and workflow automation capabilities. The platform helps teams plan, capture, manage, automate, and report on work across the enterprise. Smartsheet serves various industries and use cases, from simple project tracking to complex work management scenarios, and integrates with popular business applications to create a comprehensive work ecosystem.",
        "wikipediaSlug": "Smartsheet",
        "isHeadquarters": true,
        "lat": 47.6150107,
        "lng": -122.1957478
    },
    {
        "name": "Bungie",
        "address": "550 106th Ave NE, Bellevue, WA 98004",
        "id": "0f31ee2f-55ef-4b06-93a5-fd68b1eb596e",
        "imageName": "bungie.net.jpg",
        "description": "Bungie is an independent video game development studio known for creating iconic gaming franchises. Founded in 1991, Bungie developed the Marathon series, Myth series, and most notably the Halo franchise while owned by Microsoft. After becoming independent in 2007, Bungie created the Destiny franchise, a shared-world shooter that combines elements of role-playing games with competitive multiplayer. The company is recognized for innovative gameplay mechanics, compelling storytelling, and building passionate gaming communities around their titles.",
        "wikipediaSlug": "Bungie",
        "isHeadquarters": true,
        "lat": 47.6153765,
        "lng": -122.1986415
    },
    {
        "name": "Valve Corporation",
        "address": "10900 NE 4th St #500, Bellevue, WA 98004",
        "id": "62aa3d39-f636-46f9-bbeb-dd960f0ea7f0",
        "imageName": "valvesoftware.com.jpg",
        "description": "Valve Corporation is a video game developer and digital distribution company. Founded in 1996 by former Microsoft employees, Valve created the critically acclaimed Half-Life series, Portal series, and Team Fortress games. The company revolutionized PC gaming with Steam, a digital distribution platform launched in 2003 that became the dominant marketplace for PC games. Valve also developed the Source game engine and hardware like the Steam Deck handheld gaming device, maintaining a significant influence on the gaming industry.",
        "wikipediaSlug": "Valve_Corporation",
        "isHeadquarters": true,
        "lat": 47.6141163,
        "lng": -122.1944737
    },
    {
        "name": "Big Fish Games",
        "address": "906 Alaskan Way #700, Seattle, WA 98104",
        "id": "61a2781e-374a-4ff9-ab59-52caf532ac31",
        "imageName": "bigfishgames.com.jpg",
        "description": "Big Fish Games is a casual video game developer and publisher founded in 2002. The company specializes in downloadable casual games across various genres including hidden object, time management, puzzle, and adventure games. Big Fish Games operates a digital distribution platform offering thousands of games for PC, Mac, and mobile devices. Known for high-quality, family-friendly gaming experiences, the company has published popular series like Mystery Case Files and has expanded into mobile gaming and free-to-play titles.",
        "wikipediaSlug": "Big_Fish_Games",
        "isHeadquarters": true,
        "lat": 47.60358420000001,
        "lng": -122.3375176
    },
    {
        "name": "PopCap Games",
        "address": "2401 4th Ave #300, Seattle, WA 98121",
        "id": "1ab15daa-4565-49d7-86ab-3a59ccdb07ce",
        "imageName": "popcap.com.jpg",
        "description": "PopCap Games is a casual video game developer best known for creating addictive and accessible puzzle games. Founded in 2000, PopCap developed iconic franchises including Bejeweled, Plants vs. Zombies, Peggle, and Zuma. The company pioneered the casual gaming market with simple yet engaging gameplay mechanics that appealed to broad audiences. Electronic Arts acquired PopCap in 2011 for $1.3 billion, and the studio continues to develop mobile and casual games under the EA umbrella.",
        "wikipediaSlug": "PopCap_Games",
        "isHeadquarters": true,
        "lat": 47.61621359999999,
        "lng": -122.3460134
    },
    {
        "name": "Nintendo of America",
        "address": "4600 150th Ave NE, Redmond, WA 98052",
        "id": "ae0c8f51-3fec-4e4f-88d9-8a60e8526dc6",
        "imageName": "nintendo.com.jpg",
        "description": "Nintendo of America (NOA) is the American subsidiary of Japanese video game company Nintendo. Established in 1980, NOA is responsible for marketing, sales, and distribution of Nintendo products in North America. The company played a crucial role in revitalizing the video game industry after the 1983 crash with the Nintendo Entertainment System (NES). NOA continues to localize and promote Nintendo's gaming hardware and software, including the Switch console and franchises like Mario, Zelda, and Pokémon.",
        "wikipediaSlug": "Nintendo_of_America",
        "isHeadquarters": true,
        "lat": 47.6510301,
        "lng": -122.1391922
    },
    {
        "name": "Getty Images",
        "address": "605 5th Ave S #400, Seattle, WA 98104",
        "id": "f5e56ffd-936c-49c3-a545-b6a4789ceb2c",
        "imageName": "gettyimages.com.jpg",
        "description": "Getty Images is a global visual content company that supplies stock photos, editorial photography, video, and music to businesses, media organizations, and individuals. Founded in 1995, Getty Images maintains one of the world's largest collections of creative and editorial imagery, serving customers in over 100 countries. The company provides content for advertising, marketing, corporate communications, and media publications. Getty Images has evolved to offer AI-powered search and licensing solutions while maintaining high-quality standards for visual content.",
        "wikipediaSlug": "Getty_Images",
        "isHeadquarters": true,
        "lat": 47.5969467,
        "lng": -122.3284606
    },
    {
        "name": "Auth0",
        "address": "10800 NE 8th St #600, Bellevue, WA 98004",
        "id": "7bba7ff8-05ef-4a11-ae45-9cfcaa32fa76",
        "imageName": "auth0.com.jpg",
        "description": "Auth0 is an identity management platform that provides authentication and authorization services for applications and APIs. Founded in 2013, Auth0 offers developers tools to implement secure login systems, single sign-on (SSO), multi-factor authentication, and user management features. The platform serves businesses of all sizes, from startups to enterprises, helping them secure their applications and improve user experience. Okta acquired Auth0 in 2021 for $6.5 billion, integrating it into their identity and access management ecosystem.",
        "wikipediaSlug": "Auth0",
        "isHeadquarters": true,
        "lat": 47.617845,
        "lng": -122.1958669
    },
    {
        "name": "Moz",
        "address": "1752 NW Market St, Seattle, WA 98107",
        "id": "c5e1522a-a2ea-4542-a2bb-eb389a401b02",
        "imageName": "moz.com.jpg",
        "description": "Moz is a software company that provides search engine optimization (SEO) tools and resources. Founded in 2004 by Rand Fishkin, Moz develops tools for keyword research, link building, site audits, and rank tracking to help businesses improve their search engine visibility. The company also offers educational content, industry reports, and community resources for SEO professionals. Moz's products include Moz Pro, Moz Local, and various free SEO tools that have become industry standards for digital marketing professionals.",
        "wikipediaSlug": "Moz_(company)",
        "isHeadquarters": true,
        "lat": 47.6688956,
        "lng": -122.3811703
    },
    {
        "name": "Amazon Fresh",
        "address": "1227 124th Ave NE, Bellevue, WA 98005",
        "id": "b260793c-647e-4658-9457-2739ec7685fd",
        "imageName": "amazonfresh.com.jpg",
        "description": "Amazon Fresh is Amazon's grocery delivery service and chain of physical grocery stores. Initially launched in 2007 as a delivery-only service in Seattle, it evolved into a chain of cashierless supermarkets in 2020. Amazon Fresh stores feature advanced technology including Amazon Dash Carts for streamlined shopping and Just Walk Out technology. The service offers fresh produce, meat, seafood, and Amazon-branded products, serving as a subsidiary of Amazon focused on revolutionizing grocery shopping through technology integration.",
        "wikipediaSlug": "Amazon_Fresh",
        "isHeadquarters": true,
        "lat": 47.62231,
        "lng": -122.1753189
    },
    {
        "name": "Bluesky",
        "address": "113 Cherry Street Suite 24821, Seattle, WA 98104",
        "id": "a6fe8e6f-1d4c-47f5-a6cb-7f005c90ac19",
        "imageName": "bsky.app.jpg",
        "description": "Bluesky is a decentralized social media platform that operates as a microblogging service similar to Twitter. Founded in 2021 and spun out from Twitter's research initiative, Bluesky is built on the AT Protocol, an open communication protocol for distributed social networks. The platform features algorithmic choice, custom feeds, and user-managed moderation. Bluesky emphasizes user control and composability, offering features like domain-based handles for verification and starter packs for community building. The company is structured as a benefit corporation focused on developing open social internet technologies.",
        "wikipediaSlug": "Bluesky",
        "isHeadquarters": true,
        "lat": 47.6026957,
        "lng": -122.3333383
    }
]